iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define SYSCFG_VREFBUF_0 (*(volatile struct SYSCFG_VREFBUF_0_tag *) 0x40010000)

struct TAMP_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1E:1;
      uint64_t TAMP2E:1;
      uint64_t reservedSpace0:14;
      uint64_t ITAMP1E:1;
      uint64_t reservedSpace1:1;
      uint64_t ITAMP3E:1;
      uint64_t ITAMP4E:1;
      uint64_t ITAMP5E:1;
      uint64_t ITAMP6E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1NOER:1;
      uint64_t TAMP2NOER:1;
      uint64_t reservedSpace0:14;
      uint64_t TAMP1MSK:1;
      uint64_t TAMP2MSK:1;
      uint64_t reservedSpace1:6;
      uint64_t TAMP1TRG:1;
      uint64_t TAMP2TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMPFREQ:3;
      uint64_t TAMPFLT:2;
      uint64_t TAMPPRCH:2;
      uint64_t TAMPPUDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLTCR;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1IE:1;
      uint64_t TAMP2IE:1;
      uint64_t reservedSpace0:14;
      uint64_t ITAMP1IE:1;
      uint64_t reservedSpace1:1;
      uint64_t ITAMP3IE:1;
      uint64_t ITAMP4IE:1;
      uint64_t ITAMP5IE:1;
      uint64_t ITAMP6IE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1F:1;
      uint64_t TAMP2F:1;
      uint64_t reservedSpace0:14;
      uint64_t ITAMP1F:1;
      uint64_t reservedSpace1:1;
      uint64_t ITAMP3F:1;
      uint64_t ITAMP4F:1;
      uint64_t ITAMP5F:1;
      uint64_t ITAMP6F:1;
      uint64_t ITAMP7F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1MF:1;
      uint64_t TAMP2MF:1;
      uint64_t reservedSpace0:14;
      uint64_t ITAMP1MF:1;
      uint64_t reservedSpace1:1;
      uint64_t ITAMP3MF:1;
      uint64_t ITAMP4MF:1;
      uint64_t ITAMP5MF:1;
      uint64_t ITAMP6MF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTAMP1F:1;
      uint64_t CTAMP2F:1;
      uint64_t reservedSpace0:14;
      uint64_t CITAMP1F:1;
      uint64_t reservedSpace1:1;
      uint64_t CITAMP3F:1;
      uint64_t CITAMP4F:1;
      uint64_t CITAMP5F:1;
      uint64_t CITAMP6F:1;
      uint64_t CITAMP7F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  uint8_t res3[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP3R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BKP4R;

  uint8_t res4[728];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTIONREG_OUT:8;
      uint64_t TRUST_ZONE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BACKUP_REGS:8;
      uint64_t TAMPER:4;
      uint64_t ACTIVE_TAMPER:4;
      uint64_t INT_TAMPER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINREV:4;
      uint64_t MAJREV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDR;

};

#define TAMP_0 (*(volatile struct TAMP_0_tag *) 0x4000b000)

struct UCPD1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBITCLKDIV:6;
      uint64_t IFRGAP:5;
      uint64_t TRANSWIN:5;
      uint64_t reservedSpace0:1;
      uint64_t PSC_USBPDCLK:3;
      uint64_t RXORDSETEN:9;
      uint64_t TXDMAEN:1;
      uint64_t RXDMAEN:1;
      uint64_t UCPDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFILTDIS:1;
      uint64_t RXFILT2N3:1;
      uint64_t FORCECLK:1;
      uint64_t WUPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM1_NG_CCRPD:4;
      uint64_t TRIM1_NG_CC1A5:5;
      uint64_t TRIM1_NG_CC3A0:4;
      uint64_t reservedSpace0:3;
      uint64_t TRIM2_NG_CCRPD:4;
      uint64_t TRIM2_NG_CC1A5:5;
      uint64_t TRIM2_NG_CC3A0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMODE:2;
      uint64_t TXSEND:1;
      uint64_t TXHRST:1;
      uint64_t RXMODE:1;
      uint64_t PHYRXEN:1;
      uint64_t PHYCCSEL:1;
      uint64_t ANASUBMODE:2;
      uint64_t ANAMODE:1;
      uint64_t CCENABLE:2;
      uint64_t reservedSpace0:3;
      uint64_t DBATTEN:1;
      uint64_t FRSRXEN:1;
      uint64_t FRSTX:1;
      uint64_t RDCH:1;
      uint64_t reservedSpace1:1;
      uint64_t CC1TCDIS:1;
      uint64_t CC2TCDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXISIE:1;
      uint64_t TXMSGDISCIE:1;
      uint64_t TXMSGSENTIE:1;
      uint64_t TXMSGABTIE:1;
      uint64_t HRSTDISCIE:1;
      uint64_t HRSTSENTIE:1;
      uint64_t TXUNDIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RXNEIE:1;
      uint64_t RXORDDETIE:1;
      uint64_t RXHRSTDETIE:1;
      uint64_t RXOVRIE:1;
      uint64_t RXMSGENDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t TYPECEVT1IE:1;
      uint64_t TYPECEVT2IE:1;
      uint64_t reservedSpace2:4;
      uint64_t FRSEVTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIS:1;
      uint64_t TXMSGDISC:1;
      uint64_t TXMSGSENT:1;
      uint64_t TXMSGABT:1;
      uint64_t HRSTDISC:1;
      uint64_t HRSTSENT:1;
      uint64_t TXUND:1;
      uint64_t reservedSpace0:1;
      uint64_t RXNE:1;
      uint64_t RXORDDET:1;
      uint64_t RXHRSTDET:1;
      uint64_t RXOVR:1;
      uint64_t RXMSGEND:1;
      uint64_t RXERR:1;
      uint64_t TYPECEVT1:1;
      uint64_t TYPECEVT2:1;
      uint64_t TYPEC_VSTATE_CC1:2;
      uint64_t TYPEC_VSTATE_CC2:2;
      uint64_t FRSEVT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TXMSGDISCCF:1;
      uint64_t TXMSGSENTCF:1;
      uint64_t TXMSGABTCF:1;
      uint64_t HRSTDISCCF:1;
      uint64_t HRSTSENTCF:1;
      uint64_t TXUNDCF:1;
      uint64_t reservedSpace1:2;
      uint64_t RXORDDETCF:1;
      uint64_t RXHRSTDETCF:1;
      uint64_t RXOVRCF:1;
      uint64_t RXMSGENDCF:1;
      uint64_t reservedSpace2:1;
      uint64_t TYPECEVT1CF:1;
      uint64_t TYPECEVT2CF:1;
      uint64_t reservedSpace3:4;
      uint64_t FRSEVTCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXORDSET:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_ORDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPAYSZ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PAYSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXORDSET:3;
      uint64_t RXSOP3OF4:1;
      uint64_t RXSOPKINVALID:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPAYSZ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_PAYSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOPX1:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDEXT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOPX2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDEXT2;

