iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define SPI2_1_1 (*(volatile struct SPI2_1_1_tag *) 0x40003800)

struct COMP_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:3;
      uint64_t INMSEL:4;
      uint64_t INPSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t WINMODE:1;
      uint64_t reservedSpace2:2;
      uint64_t WINOUT:1;
      uint64_t POLARITY:1;
      uint64_t HYST:2;
      uint64_t PWRMODE:2;
      uint64_t BLANKSEL:5;
      uint64_t reservedSpace3:5;
      uint64_t VALUE:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP1_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:3;
      uint64_t INMSEL:4;
      uint64_t INPSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t WINMODE:1;
      uint64_t reservedSpace2:2;
      uint64_t WINOUT:1;
      uint64_t POLARITY:1;
      uint64_t HYST:2;
      uint64_t PWRMODE:2;
      uint64_t BLANKSEL:5;
      uint64_t reservedSpace3:5;
      uint64_t VALUE:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP2_CSR;

};

#define COMP_1 (*(volatile struct COMP_1_tag *) 0x40010200)

struct SYSCFG_VREFBUF_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEM_MODE:2;
      uint64_t reservedSpace0:2;
      uint64_t PA11_PA12_RMP:1;
      uint64_t IR_POL:1;
      uint64_t IR_MOD:2;
      uint64_t BOOSTEN:1;
      uint64_t UCPD1_STROBE:1;
      uint64_t UCPD2_STROBE:1;
      uint64_t reservedSpace1:5;
      uint64_t I2C_PBx_FMP:4;
      uint64_t I2C1_FMP:1;
      uint64_t I2C2_FMP:1;
      uint64_t I2C_PAx_FMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR1;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKUP_LOCK:1;
      uint64_t SRAM_PARITY_LOCK:1;
      uint64_t PVD_LOCK:1;
      uint64_t ECC_LOCK:1;
      uint64_t reservedSpace0:4;
      uint64_t SRAM_PEF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR2;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVR:1;
      uint64_t HIZ:1;
      uint64_t reservedSpace0:1;
      uint64_t VRR:1;
      uint64_t VRS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CCR;

  uint8_t res2[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WWDG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVDOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP_bitfield:1;
      uint64_t RTC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_ITF:1;
      uint64_t FLASH_ECC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI0:1;
      uint64_t EXTI1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI2:1;
      uint64_t EXTI3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI4:1;
      uint64_t EXTI5:1;
      uint64_t EXTI6:1;
      uint64_t EXTI7:1;
      uint64_t EXTI8:1;
      uint64_t EXTI9:1;
      uint64_t EXTI10:1;
      uint64_t EXTI11:1;
      uint64_t EXTI12:1;
      uint64_t EXTI13:1;
      uint64_t EXTI14:1;
      uint64_t EXTI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCPD1_bitfield:1;
      uint64_t UCPD2_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_CH2:1;
      uint64_t DMA1_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAMUX_bitfield:1;
      uint64_t DMA1_CH4:1;
      uint64_t DMA1_CH5:1;
      uint64_t DMA1_CH6:1;
      uint64_t DMA1_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_bitfield:1;
      uint64_t COMP1:1;
      uint64_t COMP2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1_CCU:1;
      uint64_t TIM1_TRG:1;
      uint64_t TIM1_UPD:1;
      uint64_t TIM1_BRK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1_CC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM6:1;
      uint64_t DAC:1;
      uint64_t LPTIM1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM7:1;
      uint64_t LPTIM2_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM17:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART3:1;
      uint64_t USART4_bitfield:1;
      uint64_t USART5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RNG:1;
      uint64_t AES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITLINE31;

