iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint8_t res0[952];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPVER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPVER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MID;

};

#define UCPD1_1 (*(volatile struct UCPD1_1_tag *) 0x4000a000)

struct UCPD2_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBITCLKDIV:6;
      uint64_t IFRGAP:5;
      uint64_t TRANSWIN:5;
      uint64_t reservedSpace0:1;
      uint64_t PSC_USBPDCLK:3;
      uint64_t RXORDSETEN:9;
      uint64_t TXDMAEN:1;
      uint64_t RXDMAEN:1;
      uint64_t UCPDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFILTDIS:1;
      uint64_t RXFILT2N3:1;
      uint64_t FORCECLK:1;
      uint64_t WUPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM1_NG_CCRPD:4;
      uint64_t TRIM1_NG_CC1A5:5;
      uint64_t TRIM1_NG_CC3A0:4;
      uint64_t reservedSpace0:3;
      uint64_t TRIM2_NG_CCRPD:4;
      uint64_t TRIM2_NG_CC1A5:5;
      uint64_t TRIM2_NG_CC3A0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMODE:2;
      uint64_t TXSEND:1;
      uint64_t TXHRST:1;
      uint64_t RXMODE:1;
      uint64_t PHYRXEN:1;
      uint64_t PHYCCSEL:1;
      uint64_t ANASUBMODE:2;
      uint64_t ANAMODE:1;
      uint64_t CCENABLE:2;
      uint64_t reservedSpace0:3;
      uint64_t DBATTEN:1;
      uint64_t FRSRXEN:1;
      uint64_t FRSTX:1;
      uint64_t RDCH:1;
      uint64_t reservedSpace1:1;
      uint64_t CC1TCDIS:1;
      uint64_t CC2TCDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXISIE:1;
      uint64_t TXMSGDISCIE:1;
      uint64_t TXMSGSENTIE:1;
      uint64_t TXMSGABTIE:1;
      uint64_t HRSTDISCIE:1;
      uint64_t HRSTSENTIE:1;
      uint64_t TXUNDIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RXNEIE:1;
      uint64_t RXORDDETIE:1;
      uint64_t RXHRSTDETIE:1;
      uint64_t RXOVRIE:1;
      uint64_t RXMSGENDIE:1;
      uint64_t reservedSpace1:1;
      uint64_t TYPECEVT1IE:1;
      uint64_t TYPECEVT2IE:1;
      uint64_t reservedSpace2:4;
      uint64_t FRSEVTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIS:1;
      uint64_t TXMSGDISC:1;
      uint64_t TXMSGSENT:1;
      uint64_t TXMSGABT:1;
      uint64_t HRSTDISC:1;
      uint64_t HRSTSENT:1;
      uint64_t TXUND:1;
      uint64_t reservedSpace0:1;
      uint64_t RXNE:1;
      uint64_t RXORDDET:1;
      uint64_t RXHRSTDET:1;
      uint64_t RXOVR:1;
      uint64_t RXMSGEND:1;
      uint64_t RXERR:1;
      uint64_t TYPECEVT1:1;
      uint64_t TYPECEVT2:1;
      uint64_t TYPEC_VSTATE_CC1:2;
      uint64_t TYPEC_VSTATE_CC2:2;
      uint64_t FRSEVT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TXMSGDISCCF:1;
      uint64_t TXMSGSENTCF:1;
      uint64_t TXMSGABTCF:1;
      uint64_t HRSTDISCCF:1;
      uint64_t HRSTSENTCF:1;
      uint64_t TXUNDCF:1;
      uint64_t reservedSpace1:2;
      uint64_t RXORDDETCF:1;
      uint64_t RXHRSTDETCF:1;
      uint64_t RXOVRCF:1;
      uint64_t RXMSGENDCF:1;
      uint64_t reservedSpace2:1;
      uint64_t TYPECEVT1CF:1;
      uint64_t TYPECEVT2CF:1;
      uint64_t reservedSpace3:4;
      uint64_t FRSEVTCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXORDSET:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_ORDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPAYSZ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PAYSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXORDSET:3;
      uint64_t RXSOP3OF4:1;
      uint64_t RXSOPKINVALID:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPAYSZ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_PAYSZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOPX1:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDEXT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOPX2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ORDEXT2;

  uint8_t res0[952];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPVER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPVER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MID;

};

#define UCPD2_1 (*(volatile struct UCPD2_1_tag *) 0x4000a400)

struct LPTIM1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPM:1;
      uint64_t ARRM:1;
      uint64_t EXTTRIG:1;
      uint64_t CMPOK:1;
      uint64_t ARROK:1;
      uint64_t UP:1;
      uint64_t DOWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMCF:1;
      uint64_t ARRMCF:1;
      uint64_t EXTTRIGCF:1;
      uint64_t CMPOKCF:1;
      uint64_t ARROKCF:1;
      uint64_t UPCF:1;
      uint64_t DOWNCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMIE:1;
      uint64_t ARRMIE:1;
      uint64_t EXTTRIGIE:1;
      uint64_t CMPOKIE:1;
      uint64_t ARROKIE:1;
      uint64_t UPIE:1;
      uint64_t DOWNIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKSEL:1;
      uint64_t CKPOL:2;
      uint64_t CKFLT:2;
      uint64_t reservedSpace0:1;
      uint64_t TRGFLT:2;
      uint64_t reservedSpace1:1;
      uint64_t PRESC:3;
      uint64_t reservedSpace2:1;
      uint64_t TRIGSEL:3;
      uint64_t reservedSpace3:1;
      uint64_t TRIGEN:2;
      uint64_t TIMOUT:1;
      uint64_t WAVE:1;
      uint64_t WAVPOL:1;
      uint64_t PRELOAD:1;
      uint64_t COUNTMODE:1;
      uint64_t ENC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SNGSTRT:1;
      uint64_t CNTSTRT:1;
      uint64_t COUNTRST:1;
      uint64_t RSTARE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

