iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define System_Control_Space_NVIC_1_1 (*(volatile struct System_Control_Space_NVIC_1_1_tag *) 0xe000e100)

struct System_Control_Space_SysTick_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick_1_1 (*(volatile struct System_Control_Space_SysTick_1_1_tag *) 0xe000e010)

struct CRGA_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFRCENA:1;
      uint64_t HFRCSTS:1;
      uint64_t reservedSpace0:6;
      uint64_t HFXOENA:1;
      uint64_t HFXOSTS:1;
      uint64_t HFXOREADY:1;
      uint64_t reservedSpace1:5;
      uint64_t HFCLKSELREQ:1;
      uint64_t HFCLKSELSTS:1;
      uint64_t reservedSpace2:6;
      uint64_t SYSCLKSELREQ:1;
      uint64_t SYSCLKSELSTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLOCKSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFXOICFG:2;
      uint64_t HFXOREADYMODE:1;
      uint64_t HFXOFORCEREADY:1;
      uint64_t HFXOFREQ:1;
      uint64_t HFXOTESTENA:1;
      uint64_t reservedSpace0:2;
      uint64_t SYSPRESCALEENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLOCKCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFXOREADY_0:1;
      uint64_t reservedSpace0:7;
      uint64_t HFXOREADY_1:1;
      uint64_t reservedSpace1:7;
      uint64_t HFXOREADY_2:1;
      uint64_t reservedSpace2:7;
      uint64_t HFXOREADY_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFXOIRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_0:1;
      uint64_t BOR3V3_0:1;
      uint64_t BOR2V6_0:1;
      uint64_t BOR1V8_0:1;
      uint64_t WDTA_0:1;
      uint64_t reservedSpace0:3;
      uint64_t POR_1:1;
      uint64_t BOR3V3_1:1;
      uint64_t BOR2V6_1:1;
      uint64_t BOR1V8_1:1;
      uint64_t WDTA_1:1;
      uint64_t reservedSpace1:3;
      uint64_t REQ_0:1;
      uint64_t reservedSpace2:7;
      uint64_t REQ_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESETCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDD3V3:2;
      uint64_t VDD2V6:2;
      uint64_t VDD1V8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BORACTION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOR3V3THRESH:4;
      uint64_t reservedSpace0:4;
      uint64_t BOR2V6THRESH:4;
      uint64_t reservedSpace1:4;
      uint64_t BOR1V8THRESH:4;
      uint64_t reservedSpace2:4;
      uint64_t BORTESTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BORCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFXOMONENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FAULTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFXOUNSTABLE_0:1;
      uint64_t HFXOFAIL_0:1;
      uint64_t SETUPERROR_0:1;
      uint64_t reservedSpace0:5;
      uint64_t HFXOUNSTABLE_1:1;
      uint64_t HFXOFAIL_1:1;
      uint64_t SETUPERROR_1:1;
      uint64_t reservedSpace1:5;
      uint64_t HFXOUNSTABLE_2:1;
      uint64_t HFXOFAIL_2:1;
      uint64_t SETUPERROR_2:1;
      uint64_t reservedSpace2:5;
      uint64_t HFXOUNSTABLE_3:1;
      uint64_t HFXOFAIL_3:1;
      uint64_t SETUPERROR_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FAULTIRQ;

};

#define CRGA_0 (*(volatile struct CRGA_0_tag *) 0x50000000)

struct PMUA_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIBERNATE:1;
      uint64_t FASTBOOT:1;
      uint64_t FASTSHUTDOWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IGNORE_CIFS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE_BIAS:4;
      uint64_t ENABLE_1V8:4;
      uint64_t ENABLE_2V6:4;
      uint64_t ATTACH_1V8:4;
      uint64_t POWER_DOWN_MCU:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWELL;

};

#define PMUA_0 (*(volatile struct PMUA_0_tag *) 0x50000020)

struct EVTHOLD_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HOLD;

};

#define EVTHOLD_0 (*(volatile struct EVTHOLD_0_tag *) 0x50000030)

struct SS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:2;
      uint64_t reservedSpace0:6;
      uint64_t VREFL:4;
      uint64_t VREFH:4;
      uint64_t CAPSEL1U:8;
      uint64_t CAPSEL8U:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSENA:1;
      uint64_t reservedSpace0:7;
      uint64_t SSRUN:1;
      uint64_t MSTART:1;
      uint64_t MDONE:1;
      uint64_t reservedSpace1:5;
      uint64_t MTIME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t reservedSpace0:7;
      uint64_t CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PULLCNT:16;
      uint64_t DUTY1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTGM:1;
      uint64_t FB:4;
      uint64_t reservedSpace0:3;
      uint64_t CPENA:1;
      uint64_t CPCLKFREQ:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKENA:8;
      uint64_t TESTMODE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST;

