iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define SS_0 (*(volatile struct SS_0_tag *) 0x50000040)

struct FET_CTRL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HS1_CHG_ENA:1;
      uint64_t HS1_ON:1;
      uint64_t HS1_DRV_PD_ENA:1;
      uint64_t HS1_CBOOT1L_PD_ENA:1;
      uint64_t HS1_BOOT:1;
      uint64_t VSOOT_ATTACH:1;
      uint64_t HS1_CLAMP_PD_ENA:1;
      uint64_t RSENHI_PD_ENA:1;
      uint64_t HS2_CHG_ENA:1;
      uint64_t HS2_ON:1;
      uint64_t HS2_DRV_PD_ENA:1;
      uint64_t HS2_CBOOT2L_PD_ENA:1;
      uint64_t reservedSpace0:3;
      uint64_t RSENLO_PD_ENA:1;
      uint64_t LSCHGENA:1;
      uint64_t LS1ON:1;
      uint64_t LS2ON:1;
      uint64_t reservedSpace1:5;
      uint64_t LS1ONSRCSELECT:1;
      uint64_t LS2ONSRCSELECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HS1_CHG_ENA:1;
      uint64_t HS1_ON:1;
      uint64_t HS1_DRV_PD_ENA:1;
      uint64_t HS1_CBOOT1L_PD_ENA:1;
      uint64_t HS1_BOOT:1;
      uint64_t VSOOT_ATTACH:1;
      uint64_t HS1_CLAMP_PD_ENA:1;
      uint64_t RSENHI_PD_ENA:1;
      uint64_t HS2_CHG_ENA:1;
      uint64_t HS2_ON:1;
      uint64_t HS2_DRV_PD_ENA:1;
      uint64_t HS2_CBOOT2L_PD_ENA:1;
      uint64_t reservedSpace0:3;
      uint64_t RSENLO_PD_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ZTCEXTENABLE:1;
      uint64_t ZTCINTENABLE:1;
      uint64_t ZTCMODE:1;
      uint64_t ZTCTESTMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZTC;

};

#define FET_CTRL_0 (*(volatile struct FET_CTRL_0_tag *) 0x50000060)

struct VBOOST_CTRL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t HALT:1;
      uint64_t reservedSpace0:6;
      uint64_t TMAGDWELL:5;
      uint64_t reservedSpace1:3;
      uint64_t TDEMAGDWELL:5;
      uint64_t reservedSpace2:3;
      uint64_t VOUTSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMAXEVENT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMAXMODE:2;
      uint64_t IMAXSEL:2;
      uint64_t IMAXCLEAR:1;
      uint64_t reservedSpace0:3;
      uint64_t TESTENA:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST;

};

#define VBOOST_CTRL_0 (*(volatile struct VBOOST_CTRL_0_tag *) 0x50000070)

struct SYSCTRLA_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NAME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NAME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RETAIN0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RETAIN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RETAIN1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RETAIN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RETAIN2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RETAIN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RETAIN3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RETAIN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VRGL_GPB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBOOSTIMAX_0:1;
      uint64_t FETERROR_0:1;
      uint64_t reservedSpace0:6;
      uint64_t VBOOSTIMAX_1:1;
      uint64_t FETERROR_1:1;
      uint64_t reservedSpace1:6;
      uint64_t VBOOSTIMAX_2:1;
      uint64_t FETERROR_2:1;
      uint64_t reservedSpace2:6;
      uint64_t VBOOSTIMAX_3:1;
      uint64_t FETERROR_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANAFAULTIRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEBUG_ACCESS_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG_ACCESS_KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEBUG_ACCESS_ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG_ACCESS_ENABLED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_ACCESS_KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_ACCESS_KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_ACCESS_ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_ACCESS_ENABLED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBG:3;
      uint64_t reservedSpace0:1;
      uint64_t LV_VBG:3;
      uint64_t reservedSpace1:1;
      uint64_t BIAS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIASTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V1V8_CZ:4;
      uint64_t V1V8_RDIV:3;
      uint64_t reservedSpace0:1;
      uint64_t V2V6:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMUTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFOSCTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITAIL:4;
      uint64_t reservedSpace0:4;
      uint64_t CCAL:8;
      uint64_t RP1:5;
      uint64_t reservedSpace1:3;
      uint64_t RPP1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFOSCTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XO_READY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XOTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VOUT:4;
      uint64_t reservedSpace0:4;
      uint64_t IMAX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VBOOSTTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_GM:2;
      uint64_t STG1_GM:2;
      uint64_t COMP_CM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POS:5;
      uint64_t reservedSpace0:3;
      uint64_t NEG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ZTCTRIM;

