iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define SYSCTRLA_0 (*(volatile struct SYSCTRLA_0_tag *) 0x50010100)

struct IOCTRLA_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWMODE0:1;
      uint64_t PUENA0:1;
      uint64_t PDENA0:1;
      uint64_t RDENA0:1;
      uint64_t reservedSpace0:4;
      uint64_t HWMODE1:1;
      uint64_t PUENA1:1;
      uint64_t PDENA1:1;
      uint64_t RDENA1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPAP01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWMODE0:2;
      uint64_t PUENA0:1;
      uint64_t PDENA0:1;
      uint64_t STR0:1;
      uint64_t LVL0:1;
      uint64_t reservedSpace0:2;
      uint64_t HWMODE1:2;
      uint64_t PUENA1:1;
      uint64_t PDENA1:1;
      uint64_t STR1:1;
      uint64_t LVL1:1;
      uint64_t reservedSpace1:2;
      uint64_t HWMODE2:2;
      uint64_t PUENA2:1;
      uint64_t PDENA2:1;
      uint64_t STR2:1;
      uint64_t LVL2:1;
      uint64_t reservedSpace2:2;
      uint64_t HWMODE3:2;
      uint64_t PUENA3:1;
      uint64_t PDENA3:1;
      uint64_t STR3:1;
      uint64_t LVL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBP03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWMODE4:2;
      uint64_t PUENA4:1;
      uint64_t PDENA4:1;
      uint64_t STR4:1;
      uint64_t LVL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STBY_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CANCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TESTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TESTMUXSEL0:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TESTMUX0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TESTMUXSEL1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TESTMUX1;

};

#define IOCTRLA_0 (*(volatile struct IOCTRLA_0_tag *) 0x50010200)

struct PWM_PWM0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESCALE_SEL:3;
      uint64_t reservedSpace0:13;
      uint64_t PERIOD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAREQ:2;
      uint64_t reservedSpace0:6;
      uint64_t ENASTS:2;
      uint64_t reservedSpace1:6;
      uint64_t INVERT:2;
      uint64_t reservedSpace2:6;
      uint64_t UPDATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWIDTH0:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PULSE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWIDTH1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PULSE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:4;
      uint64_t reservedSpace0:12;
      uint64_t CLEAR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDGECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:4;
      uint64_t reservedSpace0:12;
      uint64_t IRQ:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDGESTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:7;
      uint64_t CLEAR:1;
      uint64_t reservedSpace1:7;
      uint64_t STATUS:1;
      uint64_t reservedSpace2:7;
      uint64_t IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTUPDATED;

};

#define PWM_PWM0_0 (*(volatile struct PWM_PWM0_0_tag *) 0x50010600)

struct PWM_PWM1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESCALE_SEL:3;
      uint64_t reservedSpace0:13;
      uint64_t PERIOD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAREQ:2;
      uint64_t reservedSpace0:6;
      uint64_t ENASTS:2;
      uint64_t reservedSpace1:6;
      uint64_t INVERT:2;
      uint64_t reservedSpace2:6;
      uint64_t UPDATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWIDTH0:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PULSE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWIDTH1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PULSE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:4;
      uint64_t reservedSpace0:12;
      uint64_t CLEAR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDGECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:4;
      uint64_t reservedSpace0:12;
      uint64_t IRQ:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDGESTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:7;
      uint64_t CLEAR:1;
      uint64_t reservedSpace1:7;
      uint64_t STATUS:1;
      uint64_t reservedSpace2:7;
      uint64_t IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTUPDATED;

};

#define PWM_PWM1_0 (*(volatile struct PWM_PWM1_0_tag *) 0x50010700)

struct SS_OFFSET_CTRL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t CANCEL:1;
      uint64_t METHOD:2;
      uint64_t ANACALOVERRIDEENABLE:1;
      uint64_t ANACALOVERRIDDENENABLE:1;
      uint64_t ANACALCOMPSENSE:1;
      uint64_t reservedSpace0:1;
      uint64_t PRESCALETICKSELECT:4;
      uint64_t reservedSpace1:4;
      uint64_t METHODPARAM:8;
      uint64_t ANACALOVERRIDDENOFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANACALSTATE:2;
      uint64_t ANACALCOMPSYNCED:1;
      uint64_t reservedSpace0:5;
      uint64_t ANACALVOFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQENA:1;
      uint64_t IRQSTS:1;
      uint64_t IRQCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ;

