iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define SS_OFFSET_CTRL_0 (*(volatile struct SS_OFFSET_CTRL_0_tag *) 0x50010800)

struct ADC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:1;
      uint64_t AUTOEN:1;
      uint64_t ATTEN:1;
      uint64_t SAMPCYC:3;
      uint64_t FRQSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t CONVERT:1;
      uint64_t CONT:1;
      uint64_t AVRGSEL:1;
      uint64_t reservedSpace0:4;
      uint64_t INSSEL:6;
      uint64_t OBSSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t CLR:1;
      uint64_t reservedSpace0:2;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

};

#define ADC_0 (*(volatile struct ADC_0_tag *) 0x50010900)

struct CAN_CTRL_0_tag
{
  union
  {
    uint64_t R;
    struct
    {
      uint64_t RBUF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(16))) RBUF;

  uint8_t res0[64];

  union
  {
    uint64_t R;
    struct
    {
      uint64_t TBUF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(8))) TBUF;

  uint8_t res1[64];

  union
  {
    uint64_t R;
    struct
    {
      uint64_t TTS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(8))) TTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSOFF:1;
      uint64_t TACTIVE:1;
      uint64_t RACTIVE:1;
      uint64_t TSSS:1;
      uint64_t TPSS:1;
      uint64_t LBMI:1;
      uint64_t LBME:1;
      uint64_t RESET:1;
      uint64_t TSA:1;
      uint64_t TSALL:1;
      uint64_t TSONE:1;
      uint64_t TPA:1;
      uint64_t TPE:1;
      uint64_t STBY:1;
      uint64_t LOM:1;
      uint64_t TBSEL:1;
      uint64_t TSSTAT:2;
      uint64_t reservedSpace0:2;
      uint64_t TTTBM:1;
      uint64_t TSMODE:1;
      uint64_t TSNEXT:1;
      uint64_t FDISO:1;
      uint64_t RSTAT:2;
      uint64_t reservedSpace1:1;
      uint64_t RBALL:1;
      uint64_t RREL:1;
      uint64_t ROV:1;
      uint64_t ROM:1;
      uint64_t SACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSFF:1;
      uint64_t EIE:1;
      uint64_t TSIE:1;
      uint64_t TPIE:1;
      uint64_t RAFIE:1;
      uint64_t RFIE:1;
      uint64_t ROIE:1;
      uint64_t RIE:1;
      uint64_t AIF:1;
      uint64_t EIF:1;
      uint64_t TSIF:1;
      uint64_t TPIF:1;
      uint64_t RAFIF:1;
      uint64_t RFIF:1;
      uint64_t ROIF:1;
      uint64_t RIF:1;
      uint64_t BEIF:1;
      uint64_t BEIE:1;
      uint64_t ALIF:1;
      uint64_t ALIE:1;
      uint64_t EPIF:1;
      uint64_t EPIE:1;
      uint64_t EPASS:1;
      uint64_t EWARN:1;
      uint64_t EWL:4;
      uint64_t AWFL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSEG1:8;
      uint64_t SSEG2:7;
      uint64_t reservedSpace0:1;
      uint64_t SSJW:7;
      uint64_t reservedSpace1:1;
      uint64_t SPRESC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSEG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEG1:5;
      uint64_t reservedSpace0:3;
      uint64_t FSEG2:4;
      uint64_t reservedSpace1:4;
      uint64_t FSJW:4;
      uint64_t reservedSpace2:4;
      uint64_t FPRESC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSEG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:5;
      uint64_t KOER:3;
      uint64_t SSPOFF:7;
      uint64_t TDCEN:1;
      uint64_t RECNT:8;
      uint64_t TECNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EALCAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACFADR:4;
      uint64_t reservedSpace0:1;
      uint64_t SELMASK:1;
      uint64_t reservedSpace1:2;
      uint64_t TIMEEN:1;
      uint64_t TIMEPOS:1;
      uint64_t reservedSpace2:6;
      uint64_t ACFEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACFCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACODE:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
      uint64_t TBPTR:6;
      uint64_t TBF:1;
      uint64_t TBE:1;
      uint64_t TTEN:1;
      uint64_t TPRESC:2;
      uint64_t TTIF:1;
      uint64_t TTIE:1;
      uint64_t TEIF:1;
      uint64_t WTIF:1;
      uint64_t WTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERSION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFID_70:8;
      uint64_t REFID_158:8;
      uint64_t REFID_2316:8;
      uint64_t REFID_2824:5;
      uint64_t reservedSpace0:2;
      uint64_t REFIDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REFMSG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TTPTR:6;
      uint64_t reservedSpace0:2;
      uint64_t TTYPE:3;
      uint64_t reservedSpace1:1;
      uint64_t TEW:3;
      uint64_t reservedSpace2:1;
      uint64_t TTTRIG0:8;
      uint64_t TTTRIG1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TTWTRIG0:8;
      uint64_t TTWTRIG1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TTWTRIG;

};

#define CAN_CTRL_0 (*(volatile struct CAN_CTRL_0_tag *) 0x50011000)

struct CAN_WRAP_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAN_FD_ENABLE:1;
      uint64_t CAN_TIMER_ENABLE:1;
      uint64_t CAN_TIMER_DIV_SEL:3;
      uint64_t CAN_TIMER_CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN_IP_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAN_SPRAM:1;
      uint64_t CAN_DPRAM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_ENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAN_SPRAM:1;
      uint64_t CAN_DPRAM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_DONE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BISTSPRAMCRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_CAN1_SPRAM_CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BISTDPRAMCRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_CAN1_DPRAM_CRC;

