iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define CAN_WRAP_0 (*(volatile struct CAN_WRAP_0_tag *) 0x50012000)

struct GPIO_0_tag
{
  union
  {
    uint64_t R;
    struct
    {
      uint64_t GPADATA:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(32))) GPADATA;

  uint8_t res0[992];

  union
  {
    uint64_t R;
    struct
    {
      uint64_t GPBDATA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(32))) GPBDATA;

  uint8_t res1[992];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPAENA:1;
      uint64_t GPBENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADIR_0:1;
      uint64_t GPAIE_0:1;
      uint64_t GPARE_0:1;
      uint64_t GPAFE_0:1;
      uint64_t GPACLR_0:1;
      uint64_t GPAACTDET_0:1;
      uint64_t reservedSpace0:2;
      uint64_t GPADIR_1:1;
      uint64_t GPAIE_1:1;
      uint64_t GPARE_1:1;
      uint64_t GPAFE_1:1;
      uint64_t GPACLR_1:1;
      uint64_t GPAACTDET_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPAP01;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBDIR_0:1;
      uint64_t GPBIE_0:1;
      uint64_t GPBRE_0:1;
      uint64_t GPBFE_0:1;
      uint64_t GPBCLR_0:1;
      uint64_t GPBACTDET_0:1;
      uint64_t reservedSpace0:2;
      uint64_t GPBDIR_1:1;
      uint64_t GPBIE_1:1;
      uint64_t GPBRE_1:1;
      uint64_t GPBFE_1:1;
      uint64_t GPBCLR_1:1;
      uint64_t GPBACTDET_1:1;
      uint64_t reservedSpace1:2;
      uint64_t GPBDIR_2:1;
      uint64_t GPBIE_2:1;
      uint64_t GPBRE_2:1;
      uint64_t GPBFE_2:1;
      uint64_t GPBCLR_2:1;
      uint64_t GPBACTDET_2:1;
      uint64_t reservedSpace2:2;
      uint64_t GPBDIR_3:1;
      uint64_t GPBIE_3:1;
      uint64_t GPBRE_3:1;
      uint64_t GPBFE_3:1;
      uint64_t GPBCLR_3:1;
      uint64_t GPBACTDET_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBP03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPBDIR_4:1;
      uint64_t GPBIE_4:1;
      uint64_t GPBRE_4:1;
      uint64_t GPBFE_4:1;
      uint64_t GPBCLR_4:1;
      uint64_t GPBACTDET_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPBP4;

};

#define GPIO_0 (*(volatile struct GPIO_0_tag *) 0x50014000)

struct TIMER_TIMER0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

};

#define TIMER_TIMER0_0 (*(volatile struct TIMER_TIMER0_0_tag *) 0x50020000)

struct TIMER_TIMER1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

};

#define TIMER_TIMER1_0 (*(volatile struct TIMER_TIMER1_0_tag *) 0x50020008)

struct TIMER_TIMER2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

};

#define TIMER_TIMER2_0 (*(volatile struct TIMER_TIMER2_0_tag *) 0x50020010)

struct TIMER_TIMER3_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARLDL:1;
      uint64_t AHLTL:1;
      uint64_t reservedSpace0:6;
      uint64_t STROBESELL:1;
      uint64_t reservedSpace1:6;
      uint64_t DBGFRZL:1;
      uint64_t reservedSpace2:15;
      uint64_t TMRCFG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARLDM:1;
      uint64_t AHLTM:1;
      uint64_t reservedSpace0:6;
      uint64_t STROBESELM:1;
      uint64_t reservedSpace1:6;
      uint64_t DBGFRZM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLDVALL:16;
      uint64_t RLDVALM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTVALL:16;
      uint64_t CNTVALM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAL:1;
      uint64_t reservedSpace0:7;
      uint64_t IRQENAL:1;
      uint64_t reservedSpace1:7;
      uint64_t OFLL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAM:1;
      uint64_t reservedSpace0:7;
      uint64_t IRQENAM:1;
      uint64_t reservedSpace1:7;
      uint64_t OFLM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSRM;

};

#define TIMER_TIMER3_0 (*(volatile struct TIMER_TIMER3_0_tag *) 0x50010400)

struct TIMER_TIMER4_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARLDL:1;
      uint64_t AHLTL:1;
      uint64_t reservedSpace0:6;
      uint64_t STROBESELL:1;
      uint64_t reservedSpace1:6;
      uint64_t DBGFRZL:1;
      uint64_t reservedSpace2:15;
      uint64_t TMRCFG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARLDM:1;
      uint64_t AHLTM:1;
      uint64_t reservedSpace0:6;
      uint64_t STROBESELM:1;
      uint64_t reservedSpace1:6;
      uint64_t DBGFRZM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLDVALL:16;
      uint64_t RLDVALM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTVALL:16;
      uint64_t CNTVALM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAL:1;
      uint64_t reservedSpace0:7;
      uint64_t IRQENAL:1;
      uint64_t reservedSpace1:7;
      uint64_t OFLL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAM:1;
      uint64_t reservedSpace0:7;
      uint64_t IRQENAM:1;
      uint64_t reservedSpace1:7;
      uint64_t OFLM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSRM;

