iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define Ethernet_MAC_1 (*(volatile struct Ethernet_MAC_1_tag *) 0x40028000)

struct Ethernet_MMC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:1;
      uint64_t CSR:1;
      uint64_t ROR:1;
      uint64_t MCF:1;
      uint64_t MCP:1;
      uint64_t MCFHP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t RFCES:1;
      uint64_t RFAES:1;
      uint64_t reservedSpace1:10;
      uint64_t RGUFS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCRIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t TGFSCS:1;
      uint64_t TGFMSCS:1;
      uint64_t reservedSpace1:5;
      uint64_t TGFS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t RFCEM:1;
      uint64_t RFAEM:1;
      uint64_t reservedSpace1:10;
      uint64_t RGUFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCRIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t TGFSCM:1;
      uint64_t TGFMSCM:1;
      uint64_t TGFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTIMR;

  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TGFSCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTGFSCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TGFMSCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTGFMSCCR;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TGFC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTGFCR;

  uint8_t res2[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFCFC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCRFCECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFAEC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCRFAECR;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RGUFC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCRGUFCR;

};

#define Ethernet_MMC_1 (*(volatile struct Ethernet_MMC_1_tag *) 0x40028100)

struct Ethernet_PTP_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSE:1;
      uint64_t TSFCU:1;
      uint64_t TSSTI:1;
      uint64_t TSSTU:1;
      uint64_t TSITE:1;
      uint64_t TTSARU:1;
      uint64_t reservedSpace0:2;
      uint64_t TSSARFE:1;
      uint64_t TSSSR:1;
      uint64_t TSPTPPSV2E:1;
      uint64_t TSSPTPOEFE:1;
      uint64_t TSSIPV6FE:1;
      uint64_t TSSIPV4FE:1;
      uint64_t TSSEME:1;
      uint64_t TSSMRME:1;
      uint64_t TSCNT:2;
      uint64_t TSPFFMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STSSI:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPSSIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STSS:31;
      uint64_t STPNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTSLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTSHUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSUSS:31;
      uint64_t TSUPNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTSLUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTSAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TTSH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TTSL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTTLR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSO:1;
      uint64_t TSTTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPTSSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSO:1;
      uint64_t TSTTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTPPPSCR;

};

#define Ethernet_PTP_1 (*(volatile struct Ethernet_PTP_1_tag *) 0x40028700)

struct Ethernet_DMA_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR:1;
      uint64_t DA:1;
      uint64_t DSL:5;
      uint64_t EDFE:1;
      uint64_t PBL:6;
      uint64_t RTPR:2;
      uint64_t FB:1;
      uint64_t RDP:6;
      uint64_t USP:1;
      uint64_t FPM:1;
      uint64_t AAB:1;
      uint64_t MB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMABMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMATPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMARPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMARDLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMATDLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:1;
      uint64_t TPSS:1;
      uint64_t TBUS:1;
      uint64_t TJTS:1;
      uint64_t ROS:1;
      uint64_t TUS:1;
      uint64_t RS:1;
      uint64_t RBUS:1;
      uint64_t RPSS:1;
      uint64_t PWTS:1;
      uint64_t ETS:1;
      uint64_t reservedSpace0:2;
      uint64_t FBES:1;
      uint64_t ERS:1;
      uint64_t AIS:1;
      uint64_t NIS:1;
      uint64_t RPS:3;
      uint64_t TPS:3;
      uint64_t EBS:3;
      uint64_t reservedSpace1:1;
      uint64_t MMCS:1;
      uint64_t PMTS:1;
      uint64_t TSTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SR:1;
      uint64_t OSF:1;
      uint64_t RTC:2;
      uint64_t reservedSpace1:1;
      uint64_t FUGF:1;
      uint64_t FEF:1;
      uint64_t reservedSpace2:5;
      uint64_t ST:1;
      uint64_t TTC:3;
      uint64_t reservedSpace3:3;
      uint64_t FTF:1;
      uint64_t TSF:1;
      uint64_t reservedSpace4:2;
      uint64_t DFRF:1;
      uint64_t RSF:1;
      uint64_t DTCEFD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAOMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:1;
      uint64_t TPSIE:1;
      uint64_t TBUIE:1;
      uint64_t TJTIE:1;
      uint64_t ROIE:1;
      uint64_t TUIE:1;
      uint64_t RIE:1;
      uint64_t RBUIE:1;
      uint64_t RPSIE:1;
      uint64_t RWTIE:1;
      uint64_t ETIE:1;
      uint64_t reservedSpace0:2;
      uint64_t FBEIE:1;
      uint64_t ERIE:1;
      uint64_t AISE:1;
      uint64_t NISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFC:16;
      uint64_t OMFC:1;
      uint64_t MFA:11;
      uint64_t OFOC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMFBOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSWTC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMARSWTR;

