iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define NVIC_0 (*(volatile struct NVIC_0_tag *) 0xe000e004)

struct IWDG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVU:1;
      uint64_t RVU:1;
      uint64_t WVU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WIN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WINR;

  uint8_t res0[988];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW:4;
      uint64_t PR_DEFAULT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINREV:4;
      uint64_t MAJREV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDR;

};

#define IWDG_1 (*(volatile struct IWDG_1_tag *) 0x40003000)

struct WWDG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t T:7;
      uint64_t WDGA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t W:7;
      uint64_t reservedSpace0:2;
      uint64_t EWI:1;
      uint64_t reservedSpace1:1;
      uint64_t WDGTB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

};

#define WWDG_1 (*(volatile struct WWDG_1_tag *) 0x40002c00)

struct FLASH_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LATENCY:3;
      uint64_t reservedSpace0:5;
      uint64_t PRFTEN:1;
      uint64_t ICEN:1;
      uint64_t reservedSpace1:1;
      uint64_t ICRST:1;
      uint64_t reservedSpace2:4;
      uint64_t EMPTY:1;
      uint64_t reservedSpace3:1;
      uint64_t DBG_SWEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPTKEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPTKEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOP:1;
      uint64_t OPERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PROGERR:1;
      uint64_t WRPERR:1;
      uint64_t PGAERR:1;
      uint64_t SIZERR:1;
      uint64_t PGSERR:1;
      uint64_t MISERR:1;
      uint64_t FASTERR:1;
      uint64_t reservedSpace1:4;
      uint64_t RDERR:1;
      uint64_t OPTVERR:1;
      uint64_t BSY:1;
      uint64_t reservedSpace2:1;
      uint64_t CFGBSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:1;
      uint64_t PER:1;
      uint64_t MER:1;
      uint64_t PNB:6;
      uint64_t reservedSpace0:7;
      uint64_t STRT:1;
      uint64_t OPTSTRT:1;
      uint64_t FSTPG:1;
      uint64_t reservedSpace1:5;
      uint64_t EOPIE:1;
      uint64_t ERRIE:1;
      uint64_t RDERRIE:1;
      uint64_t OBL_LAUNCH:1;
      uint64_t SEC_PROT:1;
      uint64_t reservedSpace2:1;
      uint64_t OPTLOCK:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR_ECC:14;
      uint64_t reservedSpace0:6;
      uint64_t SYSF_ECC:1;
      uint64_t reservedSpace1:3;
      uint64_t ECCIE:1;
      uint64_t reservedSpace2:5;
      uint64_t ECCC:1;
      uint64_t ECCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDP:8;
      uint64_t BOREN:1;
      uint64_t BORF_LEV:2;
      uint64_t BORR_LEV:2;
      uint64_t nRST_STOP:1;
      uint64_t nRST_STDBY:1;
      uint64_t nRSTS_HDW:1;
      uint64_t IDWG_SW:1;
      uint64_t IWDG_STOP:1;
      uint64_t IWDG_STDBY:1;
      uint64_t WWDG_SW:1;
      uint64_t reservedSpace0:2;
      uint64_t RAM_PARITY_CHECK:1;
      uint64_t reservedSpace1:1;
      uint64_t nBOOT_SEL:1;
      uint64_t nBOOT1:1;
      uint64_t nBOOT0:1;
      uint64_t NRST_MODE:2;
      uint64_t IRHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP1A_STRT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP1ASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP1A_END:8;
      uint64_t reservedSpace0:23;
      uint64_t PCROP_RDP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP1AER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRP1A_STRT:6;
      uint64_t reservedSpace0:10;
      uint64_t WRP1A_END:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRP1AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRP1B_STRT:6;
      uint64_t reservedSpace0:10;
      uint64_t WRP1B_END:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRP1BR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP1B_STRT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP1BSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP1B_END:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP1BER;

  uint8_t res2[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_SIZE:7;
      uint64_t reservedSpace0:9;
      uint64_t BOOT_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECR;

