iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define TIMER_TIMER4_1 (*(volatile struct TIMER_TIMER4_1_tag *) 0x50010500)

struct WDT_WDTA_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUNSTS:1;
      uint64_t BRKFLG:1;
      uint64_t WNDFLG:1;
      uint64_t reservedSpace0:5;
      uint64_t WNDMODE:1;
      uint64_t WARNIRQ:1;
      uint64_t SWFLGCLR:1;
      uint64_t reservedSpace1:5;
      uint64_t PRESCALER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMMAND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMMAND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLEAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINPER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDWND;

};

#define WDT_WDTA_1 (*(volatile struct WDT_WDTA_1_tag *) 0x50010300)

struct WDT_WDT1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t RSTEN:1;
      uint64_t RSTFLAG:1;
      uint64_t PRESET:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY;

};

#define WDT_WDT1_1 (*(volatile struct WDT_WDT1_1_tag *) 0x50020018)

struct ADC_MIBADC1_tag
{
  uint32_t RSTCTRL;
  uint32_t OPMODECTRL;
  uint32_t CLCKCTRL;
  uint32_t CALCTRL;
  uint32_t EVMODECTRL;
  uint32_t G1MODECTRL;
  uint32_t G2MODECTRL;
  uint32_t EVSRC;
  uint32_t G1SRC;
  uint32_t G2SRC;
  uint32_t EVINTENA;
  uint32_t G1INTENA;
  uint32_t G2INTENA;
  uint32_t EVINTFLG;
  uint32_t G1INTFLG;
  uint32_t G2INTFLG;
  uint32_t EVINTCTRL;
  uint32_t G1INTCTRL;
  uint32_t G2INTCTRL;
  uint32_t EVDMACTRL;
  uint32_t G1DMACTRL;
  uint32_t G2DMACTRL;
  uint32_t BNDCTRL;
  uint32_t BNDEND;
  uint32_t EVSAMP;
  uint32_t G1SAMP;
  uint32_t G2SAMP;
  uint32_t EVSR;
  uint32_t G1SR;
  uint32_t G2SR;
  uint32_t EVSEL;
  uint32_t G1SEL;
  uint32_t G2SEL;
  uint32_t CALR;
  uint32_t SMSTATE;
  uint32_t LASTCONV;
  uint32_t EVBUFFER_0;
  uint32_t EVBUFFER_1;
  uint32_t EVBUFFER_2;
  uint32_t EVBUFFER_3;
  uint32_t EVBUFFER_4;
  uint32_t EVBUFFER_5;
  uint32_t EVBUFFER_6;
  uint32_t EVBUFFER_7;
  uint32_t G1BUFFER_0;
  uint32_t G1BUFFER_1;
  uint32_t G1BUFFER_2;
  uint32_t G1BUFFER_3;
  uint32_t G1BUFFER_4;
  uint32_t G1BUFFER_5;
  uint32_t G1BUFFER_6;
  uint32_t G1BUFFER_7;
  uint32_t G2BUFFER_0;
  uint32_t G2BUFFER_1;
  uint32_t G2BUFFER_2;
  uint32_t G2BUFFER_3;
  uint32_t G2BUFFER_4;
  uint32_t G2BUFFER_5;
  uint32_t G2BUFFER_6;
  uint32_t G2BUFFER_7;
  uint32_t EVEMUBUFFER;
  uint32_t G1EMUBUFFER;
  uint32_t G2EMUBUFFER;
  uint32_t EVDIR;
  uint32_t EVDOUT;
  uint32_t EVDIN;
  uint32_t EVDSET;
  uint32_t EVDCLR;
  uint32_t EVPDR;
  uint32_t EVPDIS;
  uint32_t EVPSEL;
  uint32_t EVSAMPDISEN;
  uint32_t G1SAMPDISEN;
  uint32_t G2SAMPDISEN;
  uint32_t MAGINTCTRL1;
  uint32_t MAGINT1MSK;
  uint32_t MAGINTCTRL2;
  uint32_t MAGINT2MSK;
  uint32_t MAGINTCTRL3;
  uint32_t MAGINT3MSK;
  uint32_t MAGINTCTRL4;
  uint32_t MAGINT4MSK;
  uint32_t MAGINTCTRL5;
  uint32_t MAGINT5MSK;
  uint32_t MAGINTCTRL6;
  uint32_t MAGINT6MSK;
  uint32_t MAGTHRINTENASET;
  uint32_t MAGTHRINTENACLR;
  uint32_t MAGTHRINTFLG;
  uint32_t MAGTHRINTOFFST;
  uint32_t EVFIFORSTCTRL;
  uint32_t G1FIFORSTCTRL;
  uint32_t G2FIFORSTCTRL;
  uint32_t EVRAMADDR;
  uint32_t G1RAMADDR;
  uint32_t G2RAMADDR;
  uint32_t PARCTRL;
  uint32_t PARADDR;
  uint32_t PWRUPDLYCTRL;
};

#define ADC_MIBADC1 (*(volatile struct ADC_MIBADC1_tag *) 0xfff7c000)

struct ADC_MIBADC2_tag
{
  uint32_t RSTCTRL;
  uint32_t OPMODECTRL;
  uint32_t CLCKCTRL;
  uint32_t CALCTRL;
  uint32_t EVMODECTRL;
  uint32_t G1MODECTRL;
  uint32_t G2MODECTRL;
  uint32_t EVSRC;
  uint32_t G1SRC;
  uint32_t G2SRC;
  uint32_t EVINTENA;
  uint32_t G1INTENA;
  uint32_t G2INTENA;
  uint32_t EVINTFLG;
  uint32_t G1INTFLG;
  uint32_t G2INTFLG;
  uint32_t EVINTCTRL;
  uint32_t G1INTCTRL;
  uint32_t G2INTCTRL;
  uint32_t EVDMACTRL;
  uint32_t G1DMACTRL;
  uint32_t G2DMACTRL;
  uint32_t BNDCTRL;
  uint32_t BNDEND;
  uint32_t EVSAMP;
  uint32_t G1SAMP;
  uint32_t G2SAMP;
  uint32_t EVSR;
  uint32_t G1SR;
  uint32_t G2SR;
  uint32_t EVSEL;
  uint32_t G1SEL;
  uint32_t G2SEL;
  uint32_t CALR;
  uint32_t SMSTATE;
  uint32_t LASTCONV;
  uint32_t EVBUFFER_0;
  uint32_t EVBUFFER_1;
  uint32_t EVBUFFER_2;
  uint32_t EVBUFFER_3;
  uint32_t EVBUFFER_4;
  uint32_t EVBUFFER_5;
  uint32_t EVBUFFER_6;
  uint32_t EVBUFFER_7;
  uint32_t G1BUFFER_0;
  uint32_t G1BUFFER_1;
  uint32_t G1BUFFER_2;
  uint32_t G1BUFFER_3;
  uint32_t G1BUFFER_4;
  uint32_t G1BUFFER_5;
  uint32_t G1BUFFER_6;
  uint32_t G1BUFFER_7;
  uint32_t G2BUFFER_0;
  uint32_t G2BUFFER_1;
  uint32_t G2BUFFER_2;
  uint32_t G2BUFFER_3;
  uint32_t G2BUFFER_4;
  uint32_t G2BUFFER_5;
  uint32_t G2BUFFER_6;
  uint32_t G2BUFFER_7;
  uint32_t EVEMUBUFFER;
  uint32_t G1EMUBUFFER;
  uint32_t G2EMUBUFFER;
  uint32_t EVDIR;
  uint32_t EVDOUT;
  uint32_t EVDIN;
  uint32_t EVDSET;
  uint32_t EVDCLR;
  uint32_t EVPDR;
  uint32_t EVPDIS;
  uint32_t EVPSEL;
  uint32_t EVSAMPDISEN;
  uint32_t G1SAMPDISEN;
  uint32_t G2SAMPDISEN;
  uint32_t MAGINTCTRL1;
  uint32_t MAGINT1MSK;
  uint32_t MAGINTCTRL2;
  uint32_t MAGINT2MSK;
  uint32_t MAGINTCTRL3;
  uint32_t MAGINT3MSK;
  uint32_t MAGINTCTRL4;
  uint32_t MAGINT4MSK;
  uint32_t MAGINTCTRL5;
  uint32_t MAGINT5MSK;
  uint32_t MAGINTCTRL6;
  uint32_t MAGINT6MSK;
  uint32_t MAGTHRINTENASET;
  uint32_t MAGTHRINTENACLR;
  uint32_t MAGTHRINTFLG;
  uint32_t MAGTHRINTOFFST;
  uint32_t EVFIFORSTCTRL;
  uint32_t G1FIFORSTCTRL;
  uint32_t G2FIFORSTCTRL;
  uint32_t EVRAMADDR;
  uint32_t G1RAMADDR;
  uint32_t G2RAMADDR;
  uint32_t PARCTRL;
  uint32_t PARADDR;
  uint32_t PWRUPDLYCTRL;
};

#define ADC_MIBADC2 (*(volatile struct ADC_MIBADC2_tag *) 0xfff7c200)

struct DCAN_DCAN1_tag
{
  uint32_t CTRL;
  uint32_t ERRSTAT;
  uint32_t ERRCNT;
  uint32_t BTR;
  uint32_t INTR;
  uint32_t TEST;
  uint8_t res0[4];

