iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint32_t PARERR;
  uint32_t REL;
  uint8_t res1[92];

  uint32_t ABOT;
  uint32_t TRREQX;
  uint32_t TRREQ12;
  uint32_t TRREQ34;
  uint32_t TRREQ56;
  uint32_t TRREQ78;
  uint32_t NEWDATX;
  uint32_t NEWDAT12;
  uint32_t NEWDAT34;
  uint32_t NEWDAT56;
  uint32_t NEWDAT78;
  uint32_t INTPENX;
  uint32_t INTPEN12;
  uint32_t INTPEN34;
  uint32_t INTPEN56;
  uint32_t INTPEN78;
  uint32_t MSGVALX;
  uint32_t MSGVAL12;
  uint32_t MSGVAL34;
  uint32_t MSGVAL56;
  uint32_t MSGVAL78;
  uint8_t res2[4];

  uint32_t INTPNDMX12;
  uint32_t INTPNDMX34;
  uint32_t INTPNDMX56;
  uint32_t INTPNDMX78;
  uint8_t res3[24];

  uint32_t IF1CMD;
  uint32_t IF1MSK;
  uint32_t IF1ARB;
  uint32_t IF1MSGCTRL;
  uint32_t IF1DATA;
  uint32_t IF1DATB;
  uint8_t res4[8];

  uint32_t IF2COM;
  uint32_t IF2MSK;
  uint32_t IF2ARB;
  uint32_t IF2MSGCTRL;
  uint32_t IF2DATA;
  uint32_t IF2DATB;
  uint8_t res5[8];

  uint32_t IF3OBS;
  uint32_t IF3MSK;
  uint32_t IF3ARB;
  uint32_t IF3MSGCTRL;
  uint32_t IF3DATA;
  uint32_t IF3DATB;
  uint8_t res6[8];

  uint32_t IF3UPD12;
  uint32_t IF3UPD34;
  uint32_t IF3UPD56;
  uint32_t IF3UPD78;
  uint8_t res7[112];

  uint32_t IOCTRLTX;
  uint32_t IOCTRLRX;
};

#define DCAN_DCAN1 (*(volatile struct DCAN_DCAN1_tag *) 0xfff7dc00)

struct DCAN_DCAN2_tag
{
  uint32_t CTRL;
  uint32_t ERRSTAT;
  uint32_t ERRCNT;
  uint32_t BTR;
  uint32_t INTR;
  uint32_t TEST;
  uint8_t res0[4];

  uint32_t PARERR;
  uint32_t REL;
  uint8_t res1[92];

  uint32_t ABOT;
  uint32_t TRREQX;
  uint32_t TRREQ12;
  uint32_t TRREQ34;
  uint32_t TRREQ56;
  uint32_t TRREQ78;
  uint32_t NEWDATX;
  uint32_t NEWDAT12;
  uint32_t NEWDAT34;
  uint32_t NEWDAT56;
  uint32_t NEWDAT78;
  uint32_t INTPENX;
  uint32_t INTPEN12;
  uint32_t INTPEN34;
  uint32_t INTPEN56;
  uint32_t INTPEN78;
  uint32_t MSGVALX;
  uint32_t MSGVAL12;
  uint32_t MSGVAL34;
  uint32_t MSGVAL56;
  uint32_t MSGVAL78;
  uint8_t res2[4];

  uint32_t INTPNDMX12;
  uint32_t INTPNDMX34;
  uint32_t INTPNDMX56;
  uint32_t INTPNDMX78;
  uint8_t res3[24];

  uint32_t IF1CMD;
  uint32_t IF1MSK;
  uint32_t IF1ARB;
  uint32_t IF1MSGCTRL;
  uint32_t IF1DATA;
  uint32_t IF1DATB;
  uint8_t res4[8];

  uint32_t IF2COM;
  uint32_t IF2MSK;
  uint32_t IF2ARB;
  uint32_t IF2MSGCTRL;
  uint32_t IF2DATA;
  uint32_t IF2DATB;
  uint8_t res5[8];

  uint32_t IF3OBS;
  uint32_t IF3MSK;
  uint32_t IF3ARB;
  uint32_t IF3MSGCTRL;
  uint32_t IF3DATA;
  uint32_t IF3DATB;
  uint8_t res6[8];

  uint32_t IF3UPD12;
  uint32_t IF3UPD34;
  uint32_t IF3UPD56;
  uint32_t IF3UPD78;
  uint8_t res7[112];

  uint32_t IOCTRLTX;
  uint32_t IOCTRLRX;
};

#define DCAN_DCAN2 (*(volatile struct DCAN_DCAN2_tag *) 0xfff7de00)

struct DCAN_DCAN3_tag
{
  uint32_t CTRL;
  uint32_t ERRSTAT;
  uint32_t ERRCNT;
  uint32_t BTR;
  uint32_t INTR;
  uint32_t TEST;
  uint8_t res0[4];

  uint32_t PARERR;
  uint32_t REL;
  uint8_t res1[92];

  uint32_t ABOT;
  uint32_t TRREQX;
  uint32_t TRREQ12;
  uint32_t TRREQ34;
  uint32_t TRREQ56;
  uint32_t TRREQ78;
  uint32_t NEWDATX;
  uint32_t NEWDAT12;
  uint32_t NEWDAT34;
  uint32_t NEWDAT56;
  uint32_t NEWDAT78;
  uint32_t INTPENX;
  uint32_t INTPEN12;
  uint32_t INTPEN34;
  uint32_t INTPEN56;
  uint32_t INTPEN78;
  uint32_t MSGVALX;
  uint32_t MSGVAL12;
  uint32_t MSGVAL34;
  uint32_t MSGVAL56;
  uint32_t MSGVAL78;
  uint8_t res2[4];

  uint32_t INTPNDMX12;
  uint32_t INTPNDMX34;
  uint32_t INTPNDMX56;
  uint32_t INTPNDMX78;
  uint8_t res3[24];

  uint32_t IF1CMD;
  uint32_t IF1MSK;
  uint32_t IF1ARB;
  uint32_t IF1MSGCTRL;
  uint32_t IF1DATA;
  uint32_t IF1DATB;
  uint8_t res4[8];

  uint32_t IF2COM;
  uint32_t IF2MSK;
  uint32_t IF2ARB;
  uint32_t IF2MSGCTRL;
  uint32_t IF2DATA;
  uint32_t IF2DATB;
  uint8_t res5[8];

  uint32_t IF3OBS;
  uint32_t IF3MSK;
  uint32_t IF3ARB;
  uint32_t IF3MSGCTRL;
  uint32_t IF3DATA;
  uint32_t IF3DATB;
  uint8_t res6[8];

  uint32_t IF3UPD12;
  uint32_t IF3UPD34;
  uint32_t IF3UPD56;
  uint32_t IF3UPD78;
  uint8_t res7[112];

  uint32_t IOCTRLTX;
  uint32_t IOCTRLRX;
};

#define DCAN_DCAN3 (*(volatile struct DCAN_DCAN3_tag *) 0xfff7e000)

struct EMAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXREV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTDNCH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXTEARDOWN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXREV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTDNCH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTEARDOWN;

  uint8_t res1[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0PEND:1;
      uint64_t TX1PEND:1;
      uint64_t TX2PEND:1;
      uint64_t TX3PEND:1;
      uint64_t TX4PEND:1;
      uint64_t TX5PEND:1;
      uint64_t TX6PEND:1;
      uint64_t TX7PEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTSTATRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0PEND:1;
      uint64_t TX1PEND:1;
      uint64_t TX2PEND:1;
      uint64_t TX3PEND:1;
      uint64_t TX4PEND:1;
      uint64_t TX5PEND:1;
      uint64_t TX6PEND:1;
      uint64_t TX7PEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTSTATMASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0MASK:1;
      uint64_t TX1MASK:1;
      uint64_t TX2MASK:1;
      uint64_t TX3MASK:1;
      uint64_t TX4MASK:1;
      uint64_t TX5MASK:1;
      uint64_t TX6MASK:1;
      uint64_t TX7MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0MASK:1;
      uint64_t TX1MASK:1;
      uint64_t TX2MASK:1;
      uint64_t TX3MASK:1;
      uint64_t TX4MASK:1;
      uint64_t TX5MASK:1;
      uint64_t TX6MASK:1;
      uint64_t TX7MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTMASKCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPEND:8;
      uint64_t RXTHRESHPEND:8;
      uint64_t TXPEND:8;
      uint64_t USERINT0:1;
      uint64_t LINKINT0:1;
      uint64_t HOSTPEND:1;
      uint64_t STATPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINVECTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACEOIVECTOR;

