iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0PEND:1;
      uint64_t RX1PEND:1;
      uint64_t RX2PEND:1;
      uint64_t RX3PEND:1;
      uint64_t RX4PEND:1;
      uint64_t RX5PEND:1;
      uint64_t RX6PEND:1;
      uint64_t RX7PEND:1;
      uint64_t RX0THRESHPEND:1;
      uint64_t RX1THRESHPEND:1;
      uint64_t RX2THRESHPEND:1;
      uint64_t RX3THRESHPEND:1;
      uint64_t RX4THRESHPEND:1;
      uint64_t RX5THRESHPEND:1;
      uint64_t RX6THRESHPEND:1;
      uint64_t RX7THRESHPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTSTATRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0PEND:1;
      uint64_t RX1PEND:1;
      uint64_t RX2PEND:1;
      uint64_t RX3PEND:1;
      uint64_t RX4PEND:1;
      uint64_t RX5PEND:1;
      uint64_t RX6PEND:1;
      uint64_t RX7PEND:1;
      uint64_t RX0THRESHPEND:1;
      uint64_t RX1THRESHPEND:1;
      uint64_t RX2THRESHPEND:1;
      uint64_t RX3THRESHPEND:1;
      uint64_t RX4THRESHPEND:1;
      uint64_t RX5THRESHPEND:1;
      uint64_t RX6THRESHPEND:1;
      uint64_t RX7THRESHPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTSTATMASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0MASK:1;
      uint64_t RX1MASK:1;
      uint64_t RX2MASK:1;
      uint64_t RX3MASK:1;
      uint64_t RX4MASK:1;
      uint64_t RX5MASK:1;
      uint64_t RX6MASK:1;
      uint64_t RX7MASK:1;
      uint64_t RX0THRESHMASK:1;
      uint64_t RX1THRESHMASK:1;
      uint64_t RX2THRESHMASK:1;
      uint64_t RX3THRESHMASK:1;
      uint64_t RX4THRESHMASK:1;
      uint64_t RX5THRESHMASK:1;
      uint64_t RX6THRESHMASK:1;
      uint64_t RX7THRESHMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0MASK:1;
      uint64_t RX1MASK:1;
      uint64_t RX2MASK:1;
      uint64_t RX3MASK:1;
      uint64_t RX4MASK:1;
      uint64_t RX5MASK:1;
      uint64_t RX6MASK:1;
      uint64_t RX7MASK:1;
      uint64_t RX0THRESHMASK:1;
      uint64_t RX1THRESHMASK:1;
      uint64_t RX2THRESHMASK:1;
      uint64_t RX3THRESHMASK:1;
      uint64_t RX4THRESHMASK:1;
      uint64_t RX5THRESHMASK:1;
      uint64_t RX6THRESHMASK:1;
      uint64_t RX7THRESHMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTMASKCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATPEND:1;
      uint64_t HOSTPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTSTATRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATPEND:1;
      uint64_t HOSTPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTSTATMASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATMASK:1;
      uint64_t HOSTMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATMASK:1;
      uint64_t HOSTMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTMASKCLEAR;

  uint8_t res3[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXMULTCH:3;
      uint64_t reservedSpace0:2;
      uint64_t RXMULTEN:1;
      uint64_t reservedSpace1:2;
      uint64_t RXBROADCH:3;
      uint64_t reservedSpace2:2;
      uint64_t RXBROADEN:1;
      uint64_t reservedSpace3:2;
      uint64_t RXPROMCH:3;
      uint64_t reservedSpace4:2;
      uint64_t RXCAFEN:1;
      uint64_t RXCEFEN:1;
      uint64_t RXCSFEN:1;
      uint64_t RXCMFEN:1;
      uint64_t reservedSpace5:3;
      uint64_t RXNOCHAIN:1;
      uint64_t RXQOSEN:1;
      uint64_t RXPASSCRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMBPENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0EN:1;
      uint64_t RXCH1EN:1;
      uint64_t RXCH2EN:1;
      uint64_t RXCH3EN:1;
      uint64_t RXCH4EN:1;
      uint64_t RXCH5EN:1;
      uint64_t RXCH6EN:1;
      uint64_t RXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUNICASTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0EN:1;
      uint64_t RXCH1EN:1;
      uint64_t RXCH2EN:1;
      uint64_t RXCH3EN:1;
      uint64_t RXCH4EN:1;
      uint64_t RXCH5EN:1;
      uint64_t RXCH6EN:1;
      uint64_t RXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUNICASTCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXMAXLEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMAXLEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBUFFEROFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXBUFFEROFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFILTERTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFILTERLOWTHRESH;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX0FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX1FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX1FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX2FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX2FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX3FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX3FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX4FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX4FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX5FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX5FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX6FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX6FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX7FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX7FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX0FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX1FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX1FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX2FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX2FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX3FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX3FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX4FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX4FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX5FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX5FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX6FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX6FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX7FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX7FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FULLDUPLEX:1;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace0:1;
      uint64_t RXBUFFERFLOWEN:1;
      uint64_t TXFLOWEN:1;
      uint64_t GMIIEN:1;
      uint64_t TXPACE:1;
      uint64_t reservedSpace1:2;
      uint64_t TXPTYPE:1;
      uint64_t TXSHORTGAPEN:1;
      uint64_t CMDIDLE:1;
      uint64_t reservedSpace2:1;
      uint64_t RXOWNERSHIP:1;
      uint64_t RXOFFLENBLOCK:1;
      uint64_t RMIISPEED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFLOWACT:1;
      uint64_t RXFLOWACT:1;
      uint64_t RXQOSACT:1;
      uint64_t reservedSpace0:5;
      uint64_t RXERRCH:3;
      uint64_t reservedSpace1:1;
      uint64_t RXERRCODE:4;
      uint64_t TXERRCH:3;
      uint64_t reservedSpace2:1;
      uint64_t TXERRCODE:4;
      uint64_t reservedSpace3:7;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREE:1;
      uint64_t SOFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCELLTHRESH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACCFIG:8;
      uint64_t ADDRESSTYPE:8;
      uint64_t RXCELLDEPTH:8;
      uint64_t TXCELLDEPTH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFTRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTRESET;

