iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint8_t res5[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSRCADDR1:8;
      uint64_t MACSRCADDR0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSRCADDRLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSRCADDR5:8;
      uint64_t MACSRCADDR4:8;
      uint64_t MACSRCADDR3:8;
      uint64_t MACSRCADDR2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSRCADDRHI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACHASH1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHASH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACHASH2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHASH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBACKOFF:10;
      uint64_t reservedSpace0:2;
      uint64_t COLLCOUNT:4;
      uint64_t RNDNUM:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOFFTEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACEVAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPACETEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSETIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXPAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSETIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXPAUSE;

  uint8_t res6[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXGOODFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXBCASTFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMCASTFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXPAUSEFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXCRCERRORS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXALIGNCODEERRORS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXOVERSIZED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXJABBER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUNDERSIZED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFRAGMENTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFILTERED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXQOSFILTERED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXOCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXGOODFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXBCASTFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXMCASTFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXPAUSEFRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXDEFERRED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXCOLLISION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXSINGLECOLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXMULTICOLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXEXCESSIVECOLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXLATECOLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXUNDERRUN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXCARRIERSENSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXOCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAME64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAME65T127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAME128T255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAME256T511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAME512T1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAME1024TUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NETOCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXSOFOVERRUNS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMOFOVERRUNS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXDMAOVERRUNS;

