iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint8_t res7[624];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACADDR1:8;
      uint64_t MACADDR0:8;
      uint64_t CHANNEL:3;
      uint64_t MATCHFILT:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACADDRLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACADDR5:8;
      uint64_t MACADDR4:8;
      uint64_t MACADDR3:8;
      uint64_t MACADDR2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACADDRHI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACINDEX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINDEX;

  uint8_t res8[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX0HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX1HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX1HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX2HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX2HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX3HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX3HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX4HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX4HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX5HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX5HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX6HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX6HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX7HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX7HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX0HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX1HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX1HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX2HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX2HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX3HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX3HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX4HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX4HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX5HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX5HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX6HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX6HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX7HDP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX7HDP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX0CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX1CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX1CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX2CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX2CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX3CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX3CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX4CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX4CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX5CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX5CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX6CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX6CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX7CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX7CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX0CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX1CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX1CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX2CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX2CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX3CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX3CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX4CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX4CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX5CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX5CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX6CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX6CP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX7CP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX7CP;

};

#define EMAC (*(volatile struct EMAC_tag *) 0xfcf78000)

struct CPGMAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REVID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTRESET;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPRESCALE:12;
      uint64_t reservedSpace0:4;
      uint64_t C0RXPACEEN:1;
      uint64_t C0TXPACEEN:1;
      uint64_t C1RXPACEEN:1;
      uint64_t C1TXPACEEN:1;
      uint64_t C2RXPACEEN:1;
      uint64_t C2TXPACEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0THRESHEN:1;
      uint64_t RXCH1THRESHEN:1;
      uint64_t RXCH2THRESHEN:1;
      uint64_t RXCH3THRESHEN:1;
      uint64_t RXCH4THRESHEN:1;
      uint64_t RXCH5THRESHEN:1;
      uint64_t RXCH6THRESHEN:1;
      uint64_t RXCH7THRESHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0RXTHRESHEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0EN:1;
      uint64_t RXCH1EN:1;
      uint64_t RXCH2EN:1;
      uint64_t RXCH3EN:1;
      uint64_t RXCH4EN:1;
      uint64_t RXCH5EN:1;
      uint64_t RXCH6EN:1;
      uint64_t RXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0RXEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCH0EN:1;
      uint64_t TXCH1EN:1;
      uint64_t TXCH2EN:1;
      uint64_t TXCH3EN:1;
      uint64_t TXCH4EN:1;
      uint64_t TXCH5EN:1;
      uint64_t TXCH6EN:1;
      uint64_t TXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0TXEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERINT0EN:1;
      uint64_t LINKINT0EN:1;
      uint64_t HOSTPENDEN:1;
      uint64_t STATPENDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0MISCEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0THRESHEN:1;
      uint64_t RXCH1THRESHEN:1;
      uint64_t RXCH2THRESHEN:1;
      uint64_t RXCH3THRESHEN:1;
      uint64_t RXCH4THRESHEN:1;
      uint64_t RXCH5THRESHEN:1;
      uint64_t RXCH6THRESHEN:1;
      uint64_t RXCH7THRESHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1RXTHRESHEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0EN:1;
      uint64_t RXCH1EN:1;
      uint64_t RXCH2EN:1;
      uint64_t RXCH3EN:1;
      uint64_t RXCH4EN:1;
      uint64_t RXCH5EN:1;
      uint64_t RXCH6EN:1;
      uint64_t RXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1RXEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCH0EN:1;
      uint64_t TXCH1EN:1;
      uint64_t TXCH2EN:1;
      uint64_t TXCH3EN:1;
      uint64_t TXCH4EN:1;
      uint64_t TXCH5EN:1;
      uint64_t TXCH6EN:1;
      uint64_t TXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1TXEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERINT0EN:1;
      uint64_t LINKINT0EN:1;
      uint64_t HOSTPENDEN:1;
      uint64_t STATPENDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1MISCEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0THRESHEN:1;
      uint64_t RXCH1THRESHEN:1;
      uint64_t RXCH2THRESHEN:1;
      uint64_t RXCH3THRESHEN:1;
      uint64_t RXCH4THRESHEN:1;
      uint64_t RXCH5THRESHEN:1;
      uint64_t RXCH6THRESHEN:1;
      uint64_t RXCH7THRESHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2RXTHRESHEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0EN:1;
      uint64_t RXCH1EN:1;
      uint64_t RXCH2EN:1;
      uint64_t RXCH3EN:1;
      uint64_t RXCH4EN:1;
      uint64_t RXCH5EN:1;
      uint64_t RXCH6EN:1;
      uint64_t RXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2RXEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCH0EN:1;
      uint64_t TXCH1EN:1;
      uint64_t TXCH2EN:1;
      uint64_t TXCH3EN:1;
      uint64_t TXCH4EN:1;
      uint64_t TXCH5EN:1;
      uint64_t TXCH6EN:1;
      uint64_t TXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2TXEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERINT0EN:1;
      uint64_t LINKINT0EN:1;
      uint64_t HOSTPENDEN:1;
      uint64_t STATPENDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2MISCEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0THRESHSTAT:1;
      uint64_t RXCH1THRESHSTAT:1;
      uint64_t RXCH2THRESHSTAT:1;
      uint64_t RXCH3THRESHSTAT:1;
      uint64_t RXCH4THRESHSTAT:1;
      uint64_t RXCH5THRESHSTAT:1;
      uint64_t RXCH6THRESHSTAT:1;
      uint64_t RXCH7THRESHSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0RXTHRESHSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0STAT:1;
      uint64_t RXCH1STAT:1;
      uint64_t RXCH2STAT:1;
      uint64_t RXCH3STAT:1;
      uint64_t RXCH4STAT:1;
      uint64_t RXCH5STAT:1;
      uint64_t RXCH6STAT:1;
      uint64_t RXCH7STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0RXSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCH0STAT:1;
      uint64_t TXCH1STAT:1;
      uint64_t TXCH2STAT:1;
      uint64_t TXCH3STAT:1;
      uint64_t TXCH4STAT:1;
      uint64_t TXCH5STAT:1;
      uint64_t TXCH6STAT:1;
      uint64_t TXCH7STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0TXSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERINT0STAT:1;
      uint64_t LINKINT0STAT:1;
      uint64_t HOSTPENDSTAT:1;
      uint64_t STATPENDSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0MISCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0THRESHSTAT:1;
      uint64_t RXCH1THRESHSTAT:1;
      uint64_t RXCH2THRESHSTAT:1;
      uint64_t RXCH3THRESHSTAT:1;
      uint64_t RXCH4THRESHSTAT:1;
      uint64_t RXCH5THRESHSTAT:1;
      uint64_t RXCH6THRESHSTAT:1;
      uint64_t RXCH7THRESHSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1RXTHRESHSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0STAT:1;
      uint64_t RXCH1STAT:1;
      uint64_t RXCH2STAT:1;
      uint64_t RXCH3STAT:1;
      uint64_t RXCH4STAT:1;
      uint64_t RXCH5STAT:1;
      uint64_t RXCH6STAT:1;
      uint64_t RXCH7STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1RXSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCH0STAT:1;
      uint64_t TXCH1STAT:1;
      uint64_t TXCH2STAT:1;
      uint64_t TXCH3STAT:1;
      uint64_t TXCH4STAT:1;
      uint64_t TXCH5STAT:1;
      uint64_t TXCH6STAT:1;
      uint64_t TXCH7STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1TXSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERINT0STAT:1;
      uint64_t LINKINT0STAT:1;
      uint64_t HOSTPENDSTAT:1;
      uint64_t STATPENDSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1MISCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0THRESHSTAT:1;
      uint64_t RXCH1THRESHSTAT:1;
      uint64_t RXCH2THRESHSTAT:1;
      uint64_t RXCH3THRESHSTAT:1;
      uint64_t RXCH4THRESHSTAT:1;
      uint64_t RXCH5THRESHSTAT:1;
      uint64_t RXCH6THRESHSTAT:1;
      uint64_t RXCH7THRESHSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2RXTHRESHSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0STAT:1;
      uint64_t RXCH1STAT:1;
      uint64_t RXCH2STAT:1;
      uint64_t RXCH3STAT:1;
      uint64_t RXCH4STAT:1;
      uint64_t RXCH5STAT:1;
      uint64_t RXCH6STAT:1;
      uint64_t RXCH7STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2RXSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCH0STAT:1;
      uint64_t TXCH1STAT:1;
      uint64_t TXCH2STAT:1;
      uint64_t TXCH3STAT:1;
      uint64_t TXCH4STAT:1;
      uint64_t TXCH5STAT:1;
      uint64_t TXCH6STAT:1;
      uint64_t TXCH7STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2TXSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERINT0STAT:1;
      uint64_t LINKINT0STAT:1;
      uint64_t HOSTPENDSTAT:1;
      uint64_t STATPENDSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2MISCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIMAX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0RXIMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIMAX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0TXIMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIMAX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1RXIMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIMAX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1TXIMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIMAX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2RXIMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXIMAX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2TXIMAX;

