iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
};

#define CPGMAC (*(volatile struct CPGMAC_tag *) 0xfcf78800)

struct MDIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:16;
      uint64_t reservedSpace0:2;
      uint64_t FAULTENB:1;
      uint64_t FAULT:1;
      uint64_t PREAMBLE:1;
      uint64_t reservedSpace1:3;
      uint64_t HIGHEST_USER_CHANNEL:5;
      uint64_t reservedSpace2:1;
      uint64_t ENABLE:1;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIVE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERPHY0:1;
      uint64_t USERPHY1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINKINTRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERPHY0:1;
      uint64_t USERPHY1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINKINTMASKED;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERACCESS0:1;
      uint64_t USERACCESS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERINTRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERACCESS0:1;
      uint64_t USERACCESS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERINTMASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERACCESS0:1;
      uint64_t USERACCESS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERINTMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERACCESS0:1;
      uint64_t USERACCESS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERINTMASKCLEAR;

  uint8_t res1[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t PHYADR:5;
      uint64_t REGADR:5;
      uint64_t reservedSpace0:3;
      uint64_t ACK:1;
      uint64_t WRITE:1;
      uint64_t GO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERACCESS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYADRMON:5;
      uint64_t reservedSpace0:1;
      uint64_t LINKINTENB:1;
      uint64_t LINKSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERPHYSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t PHYADR:5;
      uint64_t REGADR:5;
      uint64_t reservedSpace0:3;
      uint64_t ACK:1;
      uint64_t WRITE:1;
      uint64_t GO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERACCESS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYADRMON:5;
      uint64_t reservedSpace0:1;
      uint64_t LINKINTENB:1;
      uint64_t LINKSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERPHYSEL1;

};

#define MDIO (*(volatile struct MDIO_tag *) 0xfcf78900)

struct OHCI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCREVISION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CBSR:2;
      uint64_t PLE:1;
      uint64_t IE:1;
      uint64_t CLE:1;
      uint64_t BLE:1;
      uint64_t HCFS:2;
      uint64_t IR:1;
      uint64_t RWC:1;
      uint64_t RWE:1;
      uint64_t RESERVED:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCR:1;
      uint64_t CLF:1;
      uint64_t BLF:1;
      uint64_t OCR:1;
      uint64_t RESERVED_0:12;
      uint64_t SOC:2;
      uint64_t RESERVED_1:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCCOMMANDSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SO:1;
      uint64_t WDH:1;
      uint64_t SF:1;
      uint64_t RD:1;
      uint64_t UE:1;
      uint64_t FNO:1;
      uint64_t RHSC:1;
      uint64_t RESERVED_0:23;
      uint64_t OC:1;
      uint64_t RESERVED_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCINTERRUPTSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SO:1;
      uint64_t WDH:1;
      uint64_t SF:1;
      uint64_t RD:1;
      uint64_t UE:1;
      uint64_t FNO:1;
      uint64_t RHSC:1;
      uint64_t RESERVED:23;
      uint64_t OC:1;
      uint64_t MIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCINTERRUPTENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SO:1;
      uint64_t WDH:1;
      uint64_t SF:1;
      uint64_t RD:1;
      uint64_t UE:1;
      uint64_t FNO:1;
      uint64_t RHSC:1;
      uint64_t RESERVED:23;
      uint64_t OC:1;
      uint64_t MIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCINTERRUPTDISABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:8;
      uint64_t HCCA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCHCCA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:4;
      uint64_t PCED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCPERIODCURRENTED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:4;
      uint64_t CHED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCCONTROLHEADED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:4;
      uint64_t CCED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCCONTROLCURRENTED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:4;
      uint64_t BHED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCBULKHEADED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:4;
      uint64_t BCED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCBULKCURRENTED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:4;
      uint64_t DH:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCDONEHEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FI:14;
      uint64_t RESERVED:2;
      uint64_t FSMPS:15;
      uint64_t FIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCFMINTERVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FR:14;
      uint64_t RESERVED:17;
      uint64_t FRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCFMREMAINING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FN:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCFMNUMBER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:14;
      uint64_t RESERVED:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCPERIODICSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LST:12;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCLSTHRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDP:8;
      uint64_t PSM:1;
      uint64_t NPS:1;
      uint64_t DT:1;
      uint64_t OCPM:1;
      uint64_t NOCP:1;
      uint64_t RESERVED:11;
      uint64_t POTPG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRHDESCRIPTORA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR:16;
      uint64_t PPCM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRHDESCRIPTORB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPS:1;
      uint64_t RESERVED_0:14;
      uint64_t DRWE:1;
      uint64_t LPSC:1;
      uint64_t RESERVED_1:14;
      uint64_t CRWE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRHSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS_CPE:1;
      uint64_t PES_SPE:1;
      uint64_t PSS_SPS:1;
      uint64_t RESERVED_0:1;
      uint64_t PRS_SPR:1;
      uint64_t RESERVED_1:3;
      uint64_t PPS_SPP:1;
      uint64_t LSDA_CPP:1;
      uint64_t RESERVED_2:6;
      uint64_t CSC:1;
      uint64_t PESC:1;
      uint64_t PSSC:1;
      uint64_t RESERVED_3:1;
      uint64_t PRSC:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRHPORTSTATUS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS_CPE:1;
      uint64_t PES_SPE:1;
      uint64_t PSS_SPS:1;
      uint64_t RESERVED_0:1;
      uint64_t PRS_SPR:1;
      uint64_t RESERVED_1:3;
      uint64_t PPS_SPP:1;
      uint64_t LSDA_CPP:1;
      uint64_t RESERVED_2:6;
      uint64_t CSC:1;
      uint64_t PESC:1;
      uint64_t PSSC:1;
      uint64_t RESERVED_3:1;
      uint64_t PRSC:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRHPORTSTATUS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS_CPE:1;
      uint64_t PES_SPE:1;
      uint64_t PSS_SPS:1;
      uint64_t RESERVED_0:1;
      uint64_t PRS_SPR:1;
      uint64_t RESERVED_1:3;
      uint64_t PPS_SPP:1;
      uint64_t LSDA_CPP:1;
      uint64_t RESERVED_2:6;
      uint64_t CSC:1;
      uint64_t PESC:1;
      uint64_t PSSC:1;
      uint64_t RESERVED_3:1;
      uint64_t PRSC:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRHPORTSTATUS_3;

  uint8_t res0[128];

