iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint32_t HOSTUEADDR_0;
  uint32_t HOSTUESTATUS;
  uint32_t HOSTTIMEOUTCTRL;
  uint32_t HOSTUEADDR_1;
};

#define OHCI (*(volatile struct OHCI_tag *) 0xfcf78b00)

struct GIO_GIO_tag
{
  uint32_t GLBCTRL;
  uint32_t PWDN;
  uint32_t INTDET;
  uint32_t INTPOL;
  uint32_t INTENASET;
  uint32_t INTENACLR;
  uint32_t INTLVLSET;
  uint32_t INTLVLCLR;
  uint32_t INTFLG;
  uint32_t OFFSTA;
  uint32_t OFFSTB;
  uint32_t EMUA;
  uint32_t EMUB;
};

#define GIO_GIO (*(volatile struct GIO_GIO_tag *) 0xfff7bc00)

struct GIO_GIOA_tag
{
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint8_t res0[224];

  uint32_t SRS;
};

#define GIO_GIOA (*(volatile struct GIO_GIOA_tag *) 0xfff7bc34)

struct GIO_GIOB_tag
{
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint8_t res0[196];

  uint32_t SRS;
};

#define GIO_GIOB (*(volatile struct GIO_GIOB_tag *) 0xfff7bc54)

struct I2C_tag
{
  uint32_t I2COAR;
  uint32_t I2CIMR;
  uint32_t I2CSTR;
  uint32_t I2CCKL;
  uint32_t I2CCKH;
  uint32_t I2CCNT;
  uint32_t I2CDRR;
  uint32_t I2CSAR;
  uint32_t I2CDXR;
  uint32_t I2CMDR;
  uint32_t I2CIVR;
  uint32_t I2CEMDR;
  uint32_t I2CPSC;
  uint32_t I2CPID1;
  uint32_t I2CPID2;
  uint32_t I2CDMACR;
  uint8_t res0[8];

  uint32_t I2CPFNC;
  uint32_t I2CPDIR;
  uint32_t I2CDIN;
  uint32_t I2CDOUT;
  uint32_t I2CDSET;
  uint32_t I2CDCLR;
  uint32_t I2CPDR;
  uint32_t I2CPDIS;
  uint32_t I2CPSEL;
  uint32_t I2CSRS;
};

#define I2C (*(volatile struct I2C_tag *) 0xfff7d400)

struct N2HET_NHET1_tag
{
  uint32_t GLBCTRL;
  uint32_t PFR;
  uint32_t ADDR;
  uint32_t OFFST1;
  uint32_t OFFST2;
  uint32_t INTENASET;
  uint32_t INTENACLR;
  uint32_t EXC1;
  uint32_t EXC2;
  uint32_t INTPRIO;
  uint32_t INTFLG;
  uint8_t res0[8];

  uint32_t HRSH;
  uint32_t XOR;
  uint32_t REQENASET;
  uint32_t REQENACLR;
  uint32_t REQDST;
  uint8_t res1[4];

  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint8_t res2[8];

  uint32_t PARCTRL;
  uint32_t PARADDR;
  uint32_t PARPINREG;
  uint32_t SFPRLD;
  uint32_t SFENA;
  uint8_t res3[4];

  uint32_t LBPAIRSEL;
  uint32_t LBPAIRDIR;
  uint32_t PINDIS;
  uint8_t res4[8];

  uint32_t HWAGCR0;
  uint32_t HWAGCR1;
  uint32_t HWAGCR2;
  uint32_t HWAENASET;
  uint32_t HWAENACLR;
  uint32_t HWALVLSET;
  uint32_t HWALVLCLR;
  uint32_t HWAFLG;
  uint32_t HWAOFF0;
  uint32_t HWAOFF1;
  uint32_t HWAACNT;
  uint32_t HWAPCNT1;
  uint32_t HWAPCNT;
  uint32_t HWASTWD;
  uint32_t HWATHNB;
  uint32_t HWATHVL;
  uint32_t HWAFIL;
  uint8_t res5[4];

  uint32_t HWAFIL2;
  uint8_t res6[4];

  uint32_t HWAANGI;
};

#define N2HET_NHET1 (*(volatile struct N2HET_NHET1_tag *) 0xfff7b800)

struct N2HET_NHET2_tag
{
  uint32_t GLBCTRL;
  uint32_t PFR;
  uint32_t ADDR;
  uint32_t OFFST1;
  uint32_t OFFST2;
  uint32_t INTENASET;
  uint32_t INTENACLR;
  uint32_t EXC1;
  uint32_t EXC2;
  uint32_t INTPRIO;
  uint32_t INTFLG;
  uint8_t res0[8];

  uint32_t HRSH;
  uint32_t XOR;
  uint32_t REQENASET;
  uint32_t REQENACLR;
  uint32_t REQDST;
  uint8_t res1[4];

  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint8_t res2[8];

  uint32_t PARCTRL;
  uint32_t PARADDR;
  uint32_t PARPINREG;
  uint32_t SFPRLD;
  uint32_t SFENA;
  uint8_t res3[4];

  uint32_t LBPAIRSEL;
  uint32_t LBPAIRDIR;
  uint32_t PINDIS;
  uint8_t res4[8];

  uint32_t HWAGCR0;
  uint32_t HWAGCR1;
  uint32_t HWAGCR2;
  uint32_t HWAENASET;
  uint32_t HWAENACLR;
  uint32_t HWALVLSET;
  uint32_t HWALVLCLR;
  uint32_t HWAFLG;
  uint32_t HWAOFF0;
  uint32_t HWAOFF1;
  uint32_t HWAACNT;
  uint32_t HWAPCNT1;
  uint32_t HWAPCNT;
  uint32_t HWASTWD;
  uint32_t HWATHNB;
  uint32_t HWATHVL;
  uint32_t HWAFIL;
  uint8_t res5[4];

  uint32_t HWAFIL2;
  uint8_t res6[4];

  uint32_t HWAANGI;
};

#define N2HET_NHET2 (*(volatile struct N2HET_NHET2_tag *) 0xfff7b900)

struct HTU_HTU1_tag
{
  uint32_t GLBCTRL;
  uint32_t CPENA;
  uint32_t BUSY0;
  uint32_t BUSY1;
  uint32_t BUSY2;
  uint32_t BUSY3;
  uint32_t ACP;
  uint8_t res0[4];

  uint32_t RLBECTRL;
  uint32_t BFINTSET;
  uint32_t BFINTCLR;
  uint32_t INTMAP;
  uint8_t res1[4];

  uint32_t INTOFFST0;
  uint32_t INTOFFST1;
  uint32_t BIM;
  uint32_t RLOSTFLG;
  uint32_t BFINTFLG;
  uint32_t BERINTFLG;
  uint32_t MP1STRT;
  uint32_t MP1END;
  uint32_t DBGCTRL;
  uint32_t WPREG;
  uint32_t WPMSK;
  uint32_t ID;
  uint32_t PARCTRL;
  uint32_t PARADDR;
  uint8_t res2[4];

  uint32_t MPCTRLSTAT;
  uint32_t MP0STRT;
  uint32_t MP0END;
};

#define HTU_HTU1 (*(volatile struct HTU_HTU1_tag *) 0xfff7a400)

struct HTU_HTU2_tag
{
  uint32_t GLBCTRL;
  uint32_t CPENA;
  uint32_t BUSY0;
  uint32_t BUSY1;
  uint32_t BUSY2;
  uint32_t BUSY3;
  uint32_t ACP;
  uint8_t res0[4];

  uint32_t RLBECTRL;
  uint32_t BFINTSET;
  uint32_t BFINTCLR;
  uint32_t INTMAP;
  uint8_t res1[4];

  uint32_t INTOFFST0;
  uint32_t INTOFFST1;
  uint32_t BIM;
  uint32_t RLOSTFLG;
  uint32_t BFINTFLG;
  uint32_t BERINTFLG;
  uint32_t MP1STRT;
  uint32_t MP1END;
  uint32_t DBGCTRL;
  uint32_t WPREG;
  uint32_t WPMSK;
  uint32_t ID;
  uint32_t PARCTRL;
  uint32_t PARADDR;
  uint8_t res2[4];

  uint32_t MPCTRLSTAT;
  uint32_t MP0STRT;
  uint32_t MP0END;
};

#define HTU_HTU2 (*(volatile struct HTU_HTU2_tag *) 0xfff7a500)

struct IOMM_tag
{
  uint32_t REV;
  uint8_t res0[4];

  uint32_t DIEID0;
  uint32_t DIEID1;
  uint32_t DIEID2;
  uint32_t DIEID3;
  uint32_t DEVID0;
  uint32_t DEVID1;
  uint32_t BOOTCONFIG0;
  uint8_t res1[20];

  uint32_t KICK0;
  uint32_t KICK1;
  uint8_t res2[160];

  uint32_t ERRRAWSTATSET;
  uint32_t ERRENASTATCLR;
  uint32_t ERRENA;
  uint32_t ERRENACLR;
  uint8_t res3[4];

  uint32_t FAULT_ADDR;
  uint32_t FAULT_STAT;
  uint32_t FAULT_CLR;
  uint8_t res4[16];

  uint32_t PINMMR0;
  uint32_t PINMMR1;
  uint32_t PINMMR2;
  uint32_t PINMMR3;
  uint32_t PINMMR4;
  uint32_t PINMMR5;
  uint32_t PINMMR6;
  uint32_t PINMMR7;
  uint32_t PINMMR8;
  uint32_t PINMMR9;
  uint32_t PINMMR10;
  uint32_t PINMMR11;
  uint32_t PINMMR12;
  uint32_t PINMMR13;
  uint32_t PINMMR14;
  uint32_t PINMMR15;
  uint32_t PINMMR16;
  uint32_t PINMMR17;
  uint32_t PINMMR18;
  uint32_t PINMMR19;
  uint32_t PINMMR20;
  uint32_t PINMMR21;
  uint32_t PINMMR22;
  uint32_t PINMMR23;
  uint32_t PINMMR24;
  uint32_t PINMMR25;
  uint32_t PINMMR26;
  uint32_t PINMMR27;
  uint32_t PINMMR28;
  uint32_t PINMMR29;
  uint32_t PINMMR30;
};

#define IOMM (*(volatile struct IOMM_tag *) 0xffffea00)

