iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
struct MIBSPI_MIBSPI1_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t INT0;
  uint32_t INTLVL;
  uint32_t INTFLG;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t TXDAT0;
  uint32_t TXDAT1;
  uint32_t RXBUF;
  uint32_t EMU;
  uint32_t DELAY;
  uint32_t DEFCS;
  uint32_t DATFMT0;
  uint32_t DATFMT1;
  uint32_t DATFMT2;
  uint32_t DATFMT3;
  uint32_t TGINTVEC0;
  uint32_t TGINTVEC1;
  uint32_t SRSEL;
  uint32_t PMCTRL;
  uint32_t MIBSPIENA;
  uint32_t TGINTENASET;
  uint32_t TGINTENACLR;
  uint32_t TGINTLVLSET;
  uint32_t TGINTLVLCLR;
  uint32_t TGINTFLG;
  uint8_t res0[8];

  uint32_t TICKCNT;
  uint32_t LTGPEND;
  uint32_t TG0CTRL;
  uint32_t TG1CTRL;
  uint32_t TG2CTRL;
  uint32_t TG3CTRL;
  uint32_t TG4CTRL;
  uint32_t TG5CTRL;
  uint32_t TG6CTRL;
  uint32_t TG7CTRL;
  uint32_t TG8CTRL;
  uint32_t TG9CTRL;
  uint32_t TG10CTRL;
  uint32_t TG11CTRL;
  uint32_t TG12CTRL;
  uint32_t TG13CTRL;
  uint32_t TG14CTRL;
  uint32_t TG15CTRL;
  uint32_t DMA0CTRL;
  uint32_t DMA1CTRL;
  uint32_t DMA2CTRL;
  uint32_t DMA3CTRL;
  uint32_t DMA4CTRL;
  uint32_t DMA5CTRL;
  uint32_t DMA6CTRL;
  uint32_t DMA7CTRL;
  uint32_t DMA0CNT;
  uint32_t DMA1CNT;
  uint32_t DMA2CNT;
  uint32_t DMA3CNT;
  uint32_t DMA4CNT;
  uint32_t DMA5CNT;
  uint32_t DMA6CNT;
  uint32_t DMA7CNT;
  uint32_t DMACNTLEN;
  uint8_t res1[4];

  uint32_t UERRCTRL;
  uint32_t UERRSTAT;
  uint32_t UERRADDR1;
  uint32_t UERRADDR0;
  uint32_t RXOVRNBUFADDR;
  uint32_t IOLPBKTSTCTRL;
  uint32_t EXTENDED_PRESCALE1;
  uint32_t EXTENDED_PRESCALE2;
  uint32_t ECCDIAG_CTRL;
  uint32_t ECCDIAG_STAT;
  uint8_t res2[180];

  uint32_t SPIREV;
};

#define MIBSPI_MIBSPI1 (*(volatile struct MIBSPI_MIBSPI1_tag *) 0xfff7f400)

struct MIBSPI_MIBSPI2_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t INT0;
  uint32_t INTLVL;
  uint32_t INTFLG;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t TXDAT0;
  uint32_t TXDAT1;
  uint32_t RXBUF;
  uint32_t EMU;
  uint32_t DELAY;
  uint32_t DEFCS;
  uint32_t DATFMT0;
  uint32_t DATFMT1;
  uint32_t DATFMT2;
  uint32_t DATFMT3;
  uint32_t TGINTVEC0;
  uint32_t TGINTVEC1;
  uint32_t SRSEL;
  uint32_t PMCTRL;
  uint32_t MIBSPIENA;
  uint32_t TGINTENASET;
  uint32_t TGINTENACLR;
  uint32_t TGINTLVLSET;
  uint32_t TGINTLVLCLR;
  uint32_t TGINTFLG;
  uint8_t res0[8];

  uint32_t TICKCNT;
  uint32_t LTGPEND;
  uint32_t TG0CTRL;
  uint32_t TG1CTRL;
  uint32_t TG2CTRL;
  uint32_t TG3CTRL;
  uint32_t TG4CTRL;
  uint32_t TG5CTRL;
  uint32_t TG6CTRL;
  uint32_t TG7CTRL;
  uint32_t TG8CTRL;
  uint32_t TG9CTRL;
  uint32_t TG10CTRL;
  uint32_t TG11CTRL;
  uint32_t TG12CTRL;
  uint32_t TG13CTRL;
  uint32_t TG14CTRL;
  uint32_t TG15CTRL;
  uint32_t DMA0CTRL;
  uint32_t DMA1CTRL;
  uint32_t DMA2CTRL;
  uint32_t DMA3CTRL;
  uint32_t DMA4CTRL;
  uint32_t DMA5CTRL;
  uint32_t DMA6CTRL;
  uint32_t DMA7CTRL;
  uint32_t DMA0CNT;
  uint32_t DMA1CNT;
  uint32_t DMA2CNT;
  uint32_t DMA3CNT;
  uint32_t DMA4CNT;
  uint32_t DMA5CNT;
  uint32_t DMA6CNT;
  uint32_t DMA7CNT;
  uint32_t DMACNTLEN;
  uint8_t res1[4];

  uint32_t UERRCTRL;
  uint32_t UERRSTAT;
  uint32_t UERRADDR1;
  uint32_t UERRADDR0;
  uint32_t RXOVRNBUFADDR;
  uint32_t IOLPBKTSTCTRL;
  uint32_t EXTENDED_PRESCALE1;
  uint32_t EXTENDED_PRESCALE2;
  uint32_t ECCDIAG_CTRL;
  uint32_t ECCDIAG_STAT;
  uint8_t res2[180];

  uint32_t SPIREV;
};

#define MIBSPI_MIBSPI2 (*(volatile struct MIBSPI_MIBSPI2_tag *) 0xfff7f600)

struct MIBSPI_MIBSPI3_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t INT0;
  uint32_t INTLVL;
  uint32_t INTFLG;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t TXDAT0;
  uint32_t TXDAT1;
  uint32_t RXBUF;
  uint32_t EMU;
  uint32_t DELAY;
  uint32_t DEFCS;
  uint32_t DATFMT0;
  uint32_t DATFMT1;
  uint32_t DATFMT2;
  uint32_t DATFMT3;
  uint32_t TGINTVEC0;
  uint32_t TGINTVEC1;
  uint32_t SRSEL;
  uint32_t PMCTRL;
  uint32_t MIBSPIENA;
  uint32_t TGINTENASET;
  uint32_t TGINTENACLR;
  uint32_t TGINTLVLSET;
  uint32_t TGINTLVLCLR;
  uint32_t TGINTFLG;
  uint8_t res0[8];

  uint32_t TICKCNT;
  uint32_t LTGPEND;
  uint32_t TG0CTRL;
  uint32_t TG1CTRL;
  uint32_t TG2CTRL;
  uint32_t TG3CTRL;
  uint32_t TG4CTRL;
  uint32_t TG5CTRL;
  uint32_t TG6CTRL;
  uint32_t TG7CTRL;
  uint32_t TG8CTRL;
  uint32_t TG9CTRL;
  uint32_t TG10CTRL;
  uint32_t TG11CTRL;
  uint32_t TG12CTRL;
  uint32_t TG13CTRL;
  uint32_t TG14CTRL;
  uint32_t TG15CTRL;
  uint32_t DMA0CTRL;
  uint32_t DMA1CTRL;
  uint32_t DMA2CTRL;
  uint32_t DMA3CTRL;
  uint32_t DMA4CTRL;
  uint32_t DMA5CTRL;
  uint32_t DMA6CTRL;
  uint32_t DMA7CTRL;
  uint32_t DMA0CNT;
  uint32_t DMA1CNT;
  uint32_t DMA2CNT;
  uint32_t DMA3CNT;
  uint32_t DMA4CNT;
  uint32_t DMA5CNT;
  uint32_t DMA6CNT;
  uint32_t DMA7CNT;
  uint32_t DMACNTLEN;
  uint8_t res1[4];

  uint32_t UERRCTRL;
  uint32_t UERRSTAT;
  uint32_t UERRADDR1;
  uint32_t UERRADDR0;
  uint32_t RXOVRNBUFADDR;
  uint32_t IOLPBKTSTCTRL;
  uint32_t EXTENDED_PRESCALE1;
  uint32_t EXTENDED_PRESCALE2;
  uint32_t ECCDIAG_CTRL;
  uint32_t ECCDIAG_STAT;
  uint8_t res2[180];

  uint32_t SPIREV;
};

#define MIBSPI_MIBSPI3 (*(volatile struct MIBSPI_MIBSPI3_tag *) 0xfff7f800)

struct MIBSPI_MIBSPI4_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t INT0;
  uint32_t INTLVL;
  uint32_t INTFLG;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t TXDAT0;
  uint32_t TXDAT1;
  uint32_t RXBUF;
  uint32_t EMU;
  uint32_t DELAY;
  uint32_t DEFCS;
  uint32_t DATFMT0;
  uint32_t DATFMT1;
  uint32_t DATFMT2;
  uint32_t DATFMT3;
  uint32_t TGINTVEC0;
  uint32_t TGINTVEC1;
  uint32_t SRSEL;
  uint32_t PMCTRL;
  uint32_t MIBSPIENA;
  uint32_t TGINTENASET;
  uint32_t TGINTENACLR;
  uint32_t TGINTLVLSET;
  uint32_t TGINTLVLCLR;
  uint32_t TGINTFLG;
  uint8_t res0[8];

  uint32_t TICKCNT;
  uint32_t LTGPEND;
  uint32_t TG0CTRL;
  uint32_t TG1CTRL;
  uint32_t TG2CTRL;
  uint32_t TG3CTRL;
  uint32_t TG4CTRL;
  uint32_t TG5CTRL;
  uint32_t TG6CTRL;
  uint32_t TG7CTRL;
  uint32_t TG8CTRL;
  uint32_t TG9CTRL;
  uint32_t TG10CTRL;
  uint32_t TG11CTRL;
  uint32_t TG12CTRL;
  uint32_t TG13CTRL;
  uint32_t TG14CTRL;
  uint32_t TG15CTRL;
  uint32_t DMA0CTRL;
  uint32_t DMA1CTRL;
  uint32_t DMA2CTRL;
  uint32_t DMA3CTRL;
  uint32_t DMA4CTRL;
  uint32_t DMA5CTRL;
  uint32_t DMA6CTRL;
  uint32_t DMA7CTRL;
  uint32_t DMA0CNT;
  uint32_t DMA1CNT;
  uint32_t DMA2CNT;
  uint32_t DMA3CNT;
  uint32_t DMA4CNT;
  uint32_t DMA5CNT;
  uint32_t DMA6CNT;
  uint32_t DMA7CNT;
  uint32_t DMACNTLEN;
  uint8_t res1[4];

