iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint32_t UERRCTRL;
  uint32_t UERRSTAT;
  uint32_t UERRADDR1;
  uint32_t UERRADDR0;
  uint32_t RXOVRNBUFADDR;
  uint32_t IOLPBKTSTCTRL;
  uint32_t EXTENDED_PRESCALE1;
  uint32_t EXTENDED_PRESCALE2;
  uint32_t ECCDIAG_CTRL;
  uint32_t ECCDIAG_STAT;
  uint8_t res2[180];

  uint32_t SPIREV;
};

#define MIBSPI_MIBSPI4 (*(volatile struct MIBSPI_MIBSPI4_tag *) 0xfff7fa00)

struct MIBSPI_MIBSPI5_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t INT0;
  uint32_t INTLVL;
  uint32_t INTFLG;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t TXDAT0;
  uint32_t TXDAT1;
  uint32_t RXBUF;
  uint32_t EMU;
  uint32_t DELAY;
  uint32_t DEFCS;
  uint32_t DATFMT0;
  uint32_t DATFMT1;
  uint32_t DATFMT2;
  uint32_t DATFMT3;
  uint32_t TGINTVEC0;
  uint32_t TGINTVEC1;
  uint32_t SRSEL;
  uint32_t PMCTRL;
  uint32_t MIBSPIENA;
  uint32_t TGINTENASET;
  uint32_t TGINTENACLR;
  uint32_t TGINTLVLSET;
  uint32_t TGINTLVLCLR;
  uint32_t TGINTFLG;
  uint8_t res0[8];

  uint32_t TICKCNT;
  uint32_t LTGPEND;
  uint32_t TG0CTRL;
  uint32_t TG1CTRL;
  uint32_t TG2CTRL;
  uint32_t TG3CTRL;
  uint32_t TG4CTRL;
  uint32_t TG5CTRL;
  uint32_t TG6CTRL;
  uint32_t TG7CTRL;
  uint32_t TG8CTRL;
  uint32_t TG9CTRL;
  uint32_t TG10CTRL;
  uint32_t TG11CTRL;
  uint32_t TG12CTRL;
  uint32_t TG13CTRL;
  uint32_t TG14CTRL;
  uint32_t TG15CTRL;
  uint32_t DMA0CTRL;
  uint32_t DMA1CTRL;
  uint32_t DMA2CTRL;
  uint32_t DMA3CTRL;
  uint32_t DMA4CTRL;
  uint32_t DMA5CTRL;
  uint32_t DMA6CTRL;
  uint32_t DMA7CTRL;
  uint32_t DMA0CNT;
  uint32_t DMA1CNT;
  uint32_t DMA2CNT;
  uint32_t DMA3CNT;
  uint32_t DMA4CNT;
  uint32_t DMA5CNT;
  uint32_t DMA6CNT;
  uint32_t DMA7CNT;
  uint32_t DMACNTLEN;
  uint8_t res1[4];

  uint32_t UERRCTRL;
  uint32_t UERRSTAT;
  uint32_t UERRADDR1;
  uint32_t UERRADDR0;
  uint32_t RXOVRNBUFADDR;
  uint32_t IOLPBKTSTCTRL;
  uint32_t EXTENDED_PRESCALE1;
  uint32_t EXTENDED_PRESCALE2;
  uint32_t ECCDIAG_CTRL;
  uint32_t ECCDIAG_STAT;
  uint8_t res2[180];

  uint32_t SPIREV;
};

#define MIBSPI_MIBSPI5 (*(volatile struct MIBSPI_MIBSPI5_tag *) 0xfff7fc00)

struct LIN_LIN1_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t GLBCTRL2;
  uint32_t SETINT;
  uint32_t CLEARINT;
  uint32_t SETINTLVL;
  uint32_t CLEARINTLVL;
  uint32_t FLR;
  uint32_t INTVECT0;
  uint32_t INTVECT1;
  uint32_t FORMAT;
  uint32_t BRSR;
  uint32_t ED;
  uint32_t RD;
  uint32_t TD;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t LINCOMP;
  uint32_t LINRD0;
  uint32_t LINRD1;
  uint32_t LINMASK;
  uint32_t LINID;
  uint32_t LINTD0;
  uint32_t LINTD1;
  uint32_t MBRSR;
  uint32_t SRSEL;
  uint8_t res0[12];

  uint32_t IODFTCTRL;
};

#define LIN_LIN1 (*(volatile struct LIN_LIN1_tag *) 0xfff7e400)

struct LIN_LIN2_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t GLBCTRL2;
  uint32_t SETINT;
  uint32_t CLEARINT;
  uint32_t SETINTLVL;
  uint32_t CLEARINTLVL;
  uint32_t FLR;
  uint32_t INTVECT0;
  uint32_t INTVECT1;
  uint32_t FORMAT;
  uint32_t BRSR;
  uint32_t ED;
  uint32_t RD;
  uint32_t TD;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t LINCOMP;
  uint32_t LINRD0;
  uint32_t LINRD1;
  uint32_t LINMASK;
  uint32_t LINID;
  uint32_t LINTD0;
  uint32_t LINTD1;
  uint32_t MBRSR;
  uint32_t SRSEL;
  uint8_t res0[12];

  uint32_t IODFTCTRL;
};

#define LIN_LIN2 (*(volatile struct LIN_LIN2_tag *) 0xfff7e500)

struct CCMR4_tag
{
  uint32_t SR;
  uint32_t KEYR;
};

#define CCMR4 (*(volatile struct CCMR4_tag *) 0xfffff600)

struct CRC_2_tag
{
  uint32_t CTRL0;
  uint8_t res0[4];

  uint32_t CTRL1;
  uint8_t res1[4];

  uint32_t CTRL2;
  uint8_t res2[4];

  uint32_t INTSET;
  uint8_t res3[4];

  uint32_t INTCLR;
  uint8_t res4[4];

  uint32_t INTSTAT;
  uint8_t res5[4];

  uint32_t INTOFFST;
  uint8_t res6[4];

  uint32_t BUSY;
  uint8_t res7[4];

  uint32_t PCOUNT1;
  uint32_t SCOUNT1;
  uint32_t CURSEC1;
  uint32_t WDTOPLD1;
  uint32_t BCTOPLD1;
  uint8_t res8[12];

  uint32_t PSASIGL1;
  uint32_t PSASIGH1;
  uint32_t CRCVALL1;
  uint32_t CRCVALH1;
  uint32_t PSASECSIGL1;
  uint32_t PSASECSIGH1;
  uint32_t RAWDATAL1;
  uint32_t RAWDATAH1;
  uint32_t PCOUNT2;
  uint32_t SCOUNT2;
  uint32_t CURSEC2;
  uint32_t WDTOPLD2;
  uint32_t BCTOPLD2;
  uint8_t res9[12];

  uint32_t PSASIGL2;
  uint32_t PSASIGH2;
  uint32_t CRCVALL2;
  uint32_t CRCVALH2;
  uint32_t PSASECSIGL2;
  uint32_t PSASECSIGH2;
  uint32_t RAWDATAL2;
  uint32_t RAWDATAH2;
  uint32_t PCOUNT3;
  uint32_t SCOUNT3;
  uint32_t CURSEC3;
  uint32_t WDTOPLD3;
  uint32_t BCTOPLD3;
  uint8_t res10[12];

  uint32_t PSASIGL3;
  uint32_t PSASIGH3;
  uint32_t CRCVALL3;
  uint32_t CRCVALH3;
  uint32_t PSASECSIGL3;
  uint32_t PSASECSIGH3;
  uint32_t RAWDATAL3;
  uint32_t RAWDATAH3;
  uint32_t PCOUNT4;
  uint32_t SCOUNT4;
  uint32_t CURSEC4;
  uint32_t WDTOPLD4;
  uint32_t BCTOPLD4;
  uint8_t res11[12];

  uint32_t PSASIGL4;
  uint32_t PSASIGH4;
  uint32_t CRCVALL4;
  uint32_t CRCVALH4;
  uint32_t PSASECSIGL4;
  uint32_t PSASECSIGH4;
  uint32_t RAWDATAL4;
  uint32_t RAWDATAH4;
  uint32_t MBUSSEL;
};

#define CRC_2 (*(volatile struct CRC_2_tag *) 0xfe000000)

struct DCC_DCC1_tag
{
  uint32_t GCTRL;
  uint32_t REV;
  uint32_t CNTSEED0;
  uint32_t VALIDSEED0;
  uint32_t CNTSEED1;
  uint32_t STAT;
  uint32_t CNT0;
  uint32_t VALID0;
  uint32_t CNT1;
  uint32_t CLKSRC1;
  uint32_t CLKSRC0;
};

#define DCC_DCC1 (*(volatile struct DCC_DCC1_tag *) 0xffffec00)

struct DCC_DCC2_tag
{
  uint32_t GCTRL;
  uint32_t REV;
  uint32_t CNTSEED0;
  uint32_t VALIDSEED0;
  uint32_t CNTSEED1;
  uint32_t STAT;
  uint32_t CNT0;
  uint32_t VALID0;
  uint32_t CNT1;
  uint32_t CLKSRC1;
  uint32_t CLKSRC0;
};

#define DCC_DCC2 (*(volatile struct DCC_DCC2_tag *) 0xfffff400)

struct DMA_1_tag
{
  uint32_t GLBCTRL;
  uint32_t CHNPND;
  uint8_t res0[4];

