iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint32_t STAT;
  uint8_t res1[4];

  uint32_t HWCHNENASET;
  uint8_t res2[4];

  uint32_t HWCHNENARST;
  uint8_t res3[4];

  uint32_t SWCHNENASET;
  uint8_t res4[4];

  uint32_t SWCHNENARST;
  uint8_t res5[4];

  uint32_t CHNPRIOSET;
  uint8_t res6[4];

  uint32_t CHNPRIORST;
  uint8_t res7[4];

  uint32_t GLBCHNINTENASET;
  uint8_t res8[4];

  uint32_t GLBCHNINTENARST;
  uint8_t res9[4];

  uint32_t REQASSG0;
  uint32_t REQASSG1;
  uint32_t REQASSG2;
  uint32_t REQASSG3;
  uint32_t REQASSG4;
  uint32_t REQASSG5;
  uint32_t REQASSG6;
  uint32_t REQASSG7;
  uint8_t res10[32];

  uint32_t PRTASSG0;
  uint32_t PRTASSG1;
  uint32_t PRTASSG2;
  uint32_t PRTASSG3;
  uint8_t res11[16];

  uint32_t FTCMAP;
  uint8_t res12[4];

  uint32_t LFSMAP;
  uint8_t res13[4];

  uint32_t HBCMAP;
  uint8_t res14[4];

  uint32_t BTCMAP;
  uint8_t res15[4];

  uint32_t BERMAP;
  uint8_t res16[4];

  uint32_t FTCINTENASET;
  uint8_t res17[4];

  uint32_t FTCINTENARST;
  uint8_t res18[4];

  uint32_t LFSINTENASET;
  uint8_t res19[4];

  uint32_t LFSINTENARST;
  uint8_t res20[4];

  uint32_t HBCINTENASET;
  uint8_t res21[4];

  uint32_t HBCINTENARST;
  uint8_t res22[4];

  uint32_t BTCINTENASET;
  uint8_t res23[4];

  uint32_t BTCINTENARST;
  uint8_t res24[4];

  uint32_t GLBINTFLG;
  uint8_t res25[4];

  uint32_t FTCINTFLG;
  uint8_t res26[4];

  uint32_t LFSINTFLG;
  uint8_t res27[4];

  uint32_t HBCINTFLG;
  uint8_t res28[4];

  uint32_t BTCINTFLG;
  uint8_t res29[4];

  uint32_t BERINTFLG;
  uint8_t res30[4];

  uint32_t FTCAOFFST;
  uint32_t LFSAOFFST;
  uint32_t HBCAOFFST;
  uint32_t BTCAOFFST;
  uint32_t BERAOFFST;
  uint32_t FTCBOFFST;
  uint32_t LSFBOFFST;
  uint32_t HBCBOFFST;
  uint32_t BTCBOFFST;
  uint32_t BERBOFFST;
  uint8_t res31[4];

  uint32_t PRTCTRL;
  uint32_t RAMTSTCTRL;
  uint32_t DBGCTRL;
  uint32_t WPREG;
  uint32_t WPMSK;
  uint32_t PRTACHNSRCADDR;
  uint32_t PRTACHNDSTADDR;
  uint32_t PRTACHNTRCNT;
  uint32_t PRTBCHNSRCADDR;
  uint32_t PRTBCHNDESTADDR;
  uint32_t PRTBCHNTRCNT;
  uint8_t res32[4];

  uint32_t PARCTRL;
  uint32_t PARERRADDR;
  uint32_t MPCTRL;
  uint32_t MPSTAT;
  uint32_t PR0STRT;
  uint32_t PR0END;
  uint32_t PR1STRT;
  uint32_t PR1END;
  uint32_t PR2STRT;
  uint32_t PR2END;
  uint32_t PR3STRT;
  uint32_t PR3END;
};

#define DMA_1 (*(volatile struct DMA_1_tag *) 0xfffff000)

struct DMM_tag
{
  uint32_t GLBCTRL;
  uint32_t INTSET;
  uint32_t INTCLR;
  uint32_t INTLVL;
  uint32_t INTFLG;
  uint32_t INTOFFST1;
  uint32_t INTOFFST2;
  uint32_t DDMDST;
  uint32_t DDMBLKSZ;
  uint32_t DDMPTR;
  uint32_t DDMINTPTR;
  uint32_t DST0RGN1;
  uint32_t DST0BLKSZ1;
  uint32_t DST0RGN2;
  uint32_t DST0BLKSZ2;
  uint32_t DST1RGN1;
  uint32_t DST1BLKSZ1;
  uint32_t DST1RGN2;
  uint32_t DST1BLKSZ2;
  uint32_t DST2RGN1;
  uint32_t DST2BLKSZ1;
  uint32_t DST2RGN2;
  uint32_t DST2BLKSZ2;
  uint32_t DST3RGN1;
  uint32_t DST3BLKSZ1;
  uint32_t DST3RGN2;
  uint32_t DST3BLKSZ2;
  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
};

#define DMM (*(volatile struct DMM_tag *) 0xfffff700)

struct ESM_tag
{
  uint32_t IFLERRPINSET1;
  uint32_t IFLERRPINCLR1;
  uint32_t INTENASET1;
  uint32_t INTENACLR1;
  uint32_t INTLVLSET1;
  uint32_t INTLVLCLR1;
  uint32_t STAT1;
  uint32_t STAT2;
  uint32_t STAT3;
  uint32_t ERRPINSTAT;
  uint32_t INTOFFSTHGH;
  uint32_t INTOFFSTLOW;
  uint32_t LTCNT;
  uint32_t LTCNTPRE;
  uint32_t ERRKEY;
  uint32_t SHDWSTAT2;
  uint32_t IFLERRPINSET4;
  uint32_t IFLERRPINCLR4;
  uint32_t INTENASET4;
  uint32_t INTENACLR4;
  uint32_t INTLVLSET4;
  uint32_t INTLVLCLR4;
  uint32_t STAT4;
};

#define ESM (*(volatile struct ESM_tag *) 0xfffff500)

struct FLASHWRAPPER_tag
{
  uint32_t FRDCNTL;
  uint32_t FSPRD;
  uint32_t FEDACCTRL1;
  uint32_t FEDACCTRL2;
  uint32_t FCORERRCNT;
  uint32_t FCORERRADDR;
  uint32_t FCORERRPOS;
  uint32_t FEDACSTAT;
  uint32_t FUNCERRADDR;
  uint32_t FEDACSDIS;
  uint32_t FPPRIMADDRTAG;
  uint32_t FREDUADDRTAG;
  uint32_t FBNKPROT;
  uint32_t FBNKSEC;
  uint32_t FBUSY;
  uint32_t FBNKACC;
  uint32_t FBNKFALLBACK;
  uint32_t FBNKPMPRDY;
  uint32_t FPMPACC1;
  uint32_t FPMPACC2;
  uint32_t FMDLACC;
  uint32_t FMDLSTAT;
  uint32_t FEMUDATMSW;
  uint32_t FEMUDATLSW;
  uint32_t FEMUECC;
  uint32_t FLOCK;
  uint32_t FEMUADDR;
  uint32_t FDIAGCTRL;
  uint32_t FRAWDATAH;
  uint32_t FRAWDATAL;
  uint32_t FRAWECC;
  uint32_t FPAROVR;
  uint8_t res0[64];

  uint32_t FEDACSDIS2;
};

#define FLASHWRAPPER (*(volatile struct FLASHWRAPPER_tag *) 0xfff87000)

struct PBIST_tag
{
  uint32_t VARADDR0;
  uint32_t VARADDR1;
  uint32_t VARADDR2;
  uint32_t VARADDR3;
  uint32_t VARLPCNT0_0;
  uint32_t VARLPCNT1_0;
  uint32_t VARLPCNT0_1;
  uint32_t VARLPCNT1_1;
  uint32_t DD0;
  uint32_t DE0;
  uint8_t res0[8];

  uint32_t CONSTADDR0;
  uint32_t CONSTADDR1;
  uint32_t CONSTADDR2;
  uint32_t CONSTADDR3;
  uint32_t CONSTLPCNT0;
  uint32_t CONSTLPCNT1;
  uint32_t CONSTLPCNT2;
  uint32_t CONSTLPCNT3;
  uint32_t CONSTINC0;
  uint32_t CONSTINC1;
  uint32_t CONSTINC2;
  uint32_t CONSTINC3;
  uint32_t RAMT;
  uint32_t DLR;
  uint32_t CMS;
  uint32_t STR;
  uint8_t res1[8];

  uint32_t CSR;
  uint32_t FDLY;
  uint32_t PACT;
  uint32_t IDR;
  uint32_t OVER;
  uint8_t res2[4];

  uint32_t FSFR0;
  uint32_t FSFR1;
  uint32_t FSRC0;
  uint32_t FSRC1;
  uint32_t FSRA0;
  uint32_t FSRA1;
  uint32_t FSRDL0;
  uint8_t res3[4];

  uint32_t FSRDL1;
  uint8_t res4[12];

  uint32_t ROM;
  uint32_t ALGO;
  uint32_t RINFOL;
  uint32_t RINFOU;
};

#define PBIST (*(volatile struct PBIST_tag *) 0xffffe500)

struct PMM_tag
{
  uint32_t LOGICPDCTRL0;
  uint32_t LOGICPDCTRL1;
  uint32_t LOGICPDCTRL2;
  uint32_t LOGICPDCTRL3;
  uint32_t MEMPDCTRL0;
  uint32_t MEMPDCTRL1;
  uint8_t res0[8];

  uint32_t PDCLKDIS;
  uint32_t PDCLKDISSET;
  uint32_t PDCLKDISCLR;
  uint8_t res1[4];

  uint32_t ISOEXTEND;
  uint32_t ISOEXTENDSET;
  uint32_t ISOEXTENDCLR;
  uint8_t res2[4];

  uint32_t LOGICPDPWRSTAT0;
  uint32_t LOGICPDPWRSTAT1;
  uint32_t LOGICPDPWRSTAT2;
  uint32_t LOGICPDPWRSTAT3;
  uint32_t LOGICPDPWRSTAT4;
  uint32_t LOGICPDPWRSTAT5;
  uint32_t LOGICPDPWRSTAT6;
  uint32_t LOGICPDPWRSTAT7;
  uint32_t LOGICPDPWRSTAT8;
  uint32_t LOGICPDPWRSTAT9;
  uint32_t LOGICPDPWRSTAT10;
  uint32_t LOGICPDPWRSTAT11;
  uint32_t LOGICPDPWRSTAT12;
  uint32_t LOGICPDPWRSTAT13;
  uint32_t LOGICPDPWRSTAT14;
  uint32_t LOGICPDPWRSTAT15;
  uint32_t MEMPWRSTAT0;
  uint32_t MEMPWRSTAT1;
  uint32_t MEMPWRSTAT2;
  uint32_t MEMPWRSTAT3;
  uint32_t MEMPWRSTAT4;
  uint32_t MEMPWRSTAT5;
  uint32_t MEMPWRSTAT6;
  uint32_t MEMPWRSTAT7;
  uint32_t GLOBALCTRL1;
  uint32_t GLOBALCTRL2;
  uint32_t GLOBALSTATUS;
  uint32_t PSCONDIAGCOMPKEY;
  uint32_t PSCONDIAGCOMPSTAT1;
  uint32_t PSCONDIAGCOMPSTAT2;
  uint32_t MPDDIACOMPSTAT1;
  uint32_t MPDDIACOMPSTAT2;
  uint32_t ISODIASTAT;
};

