iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
#define PMM (*(volatile struct PMM_tag *) 0xffff0000)

struct RTP_tag
{
  uint32_t GLBCTRL;
  uint32_t TRENA;
  uint32_t GSR;
  uint32_t RAM1REG1;
  uint32_t RAM1REG2;
  uint32_t RAM2REG1;
  uint32_t RAM2REG2;
  uint32_t RAM3REG1;
  uint32_t RAM3REG2;
  uint32_t PERREG1;
  uint32_t PERREG2;
  uint32_t DDMW;
  uint8_t res0[4];

  uint32_t FUN;
  uint32_t DIR;
  uint32_t DIN;
  uint32_t DOUT;
  uint32_t DSET;
  uint32_t DCLR;
  uint32_t PDR;
  uint32_t PDIS;
  uint32_t PSEL;
  uint32_t IODFTCTRL;
};

#define RTP (*(volatile struct RTP_tag *) 0xfffffa00)

struct RTI_tag
{
  uint32_t GLBCTRL;
  uint32_t TBCTRL;
  uint32_t CAPCTRL;
  uint32_t COMPCTRL;
  uint32_t FRC0;
  uint32_t UC0;
  uint32_t CPUC0;
  uint8_t res0[4];

  uint32_t CAFRC0;
  uint32_t CAUC0;
  uint8_t res1[8];

  uint32_t FRC1;
  uint32_t UC1;
  uint32_t CPUC1;
  uint8_t res2[4];

  uint32_t CAFRC1;
  uint32_t CAUC1;
  uint8_t res3[8];

  uint32_t COMP0;
  uint32_t UDCP0;
  uint32_t COMP1;
  uint32_t UDCP1;
  uint32_t COMP2;
  uint32_t UDCP2;
  uint32_t COMP3;
  uint32_t UDCP3;
  uint32_t TBLCOMP;
  uint32_t TBHCOMP;
  uint8_t res4[8];

  uint32_t SETINT;
  uint32_t CLEARINT;
  uint32_t INTFLAG;
  uint8_t res5[4];

  uint32_t DWDCTRL;
  uint32_t DWDPRLD;
  uint32_t WDSTATUS;
  uint32_t WDKEY;
  uint32_t WDCNTR;
  uint32_t RTIWWDRXNCTRL;
  uint32_t RTIWWDSIZECTRL;
  uint32_t RTIINTCLRENABLE;
  uint32_t RTICOMP0CLR;
  uint32_t RTICOMP1CLR;
  uint32_t RTICOMP2CLR;
  uint32_t RTICOMP3CLR;
};

#define RTI (*(volatile struct RTI_tag *) 0xfffffc00)

struct STC_tag
{
  uint32_t GLBCTRL0;
  uint32_t GLBCTRL1;
  uint32_t TPR;
  uint32_t CADDR;
  uint32_t CICNT;
  uint32_t GSTAT;
  uint32_t FSTAT;
  uint32_t CPU1CURMISR3;
  uint32_t CPU1CURMISR2;
  uint32_t CPU1CURMISR1;
  uint32_t CPU1CURMISR0;
  uint32_t CPU2CURMISR3;
  uint32_t CPU2CURMISR2;
  uint32_t CPU2CURMISR1;
  uint32_t CPU2CURMISR0;
  uint32_t STCSCSCR;
};

#define STC (*(volatile struct STC_tag *) 0xffffe600)

struct SYS_tag
{
  uint32_t SYSPC1;
  uint32_t SYSPC2;
  uint32_t SYSPC3;
  uint32_t SYSPC4;
  uint32_t SYSPC5;
  uint32_t SYSPC6;
  uint32_t SYSPC7;
  uint32_t SYSPC8;
  uint32_t SYSPC9;
  uint8_t res0[12];

  uint32_t CSDIS;
  uint32_t CSDISSET;
  uint32_t CSDISCLR;
  uint32_t CDDIS;
  uint32_t CDDISSET;
  uint32_t CDDISCLR;
  uint32_t GHVSRC;
  uint32_t VLCKASRC;
  uint32_t RCLKSRC;
  uint32_t CSVSTAT;
  uint32_t MSTGLBCTRL;
  uint32_t MINITGLBCTRL;
  uint32_t MSINENA;
  uint32_t MSTFAIL;
  uint32_t MSTCGSTAT;
  uint32_t MINISTAT;
  uint32_t PLLCTL1;
  uint32_t PLLCTL2;
  uint32_t SYSPC10;
  uint32_t DIEIDL;
  uint32_t DIEIDH;
  uint8_t res1[4];

  uint32_t LPOMONCTL;
  uint32_t CLKTEST;
  uint32_t DFTCTRLREG;
  uint32_t DFTCTRLREG2;
  uint8_t res2[8];

  uint32_t GPREG1;
  uint8_t res3[4];

  uint32_t IMPFASTS;
  uint32_t IMPFTADD;
  uint32_t SSIR1_0;
  uint32_t SSIR2;
  uint32_t SSIR3;
  uint32_t SSIR4;
  uint32_t RAMGLBCTRL;
  uint32_t BMMCR1;
  uint32_t BMMCR2;
  uint32_t MMUGLBCTRL;
  uint32_t CLKCNTL;
  uint32_t ECPCNTL;
  uint8_t res4[4];

  uint32_t DEVCR1;
  uint32_t SYSECR;
  uint32_t SYSESR;
  uint32_t SYSTASR;
  uint32_t GLBSTAT;
  uint32_t DEVID;
  uint32_t SSIVEC;
  uint32_t SSIF;
  uint32_t SSIR1_1;
};

#define SYS (*(volatile struct SYS_tag *) 0xffffff00)

struct SYS2_tag
{
  uint32_t PLLCTL3;
  uint8_t res0[4];

  uint32_t STCCLKDIV;
  uint32_t CLKHB_GLBREG;
  uint32_t CLKHB_RTIDREG;
  uint32_t HBCD_STAT;
  uint8_t res1[8];

  uint32_t CLKTRMI1;
  uint8_t res2[24];

  uint32_t CLK2CNTRL;
  uint32_t VCLKACON1;
  uint8_t res3[44];

  uint32_t CLKSLIP;
  uint8_t res4[120];

  uint32_t EFC_CTLREG;
  uint32_t DIEIDL_REG0;
  uint32_t DIEIDH_REG1;
  uint32_t DIEIDH_REG2;
  uint32_t DIEIDH_REG3;
};

#define SYS2 (*(volatile struct SYS2_tag *) 0xffffe100)

struct VIM_tag
{
  uint32_t IRQIVEC;
  uint32_t FIQIVEC;
  uint8_t res0[8];

  uint32_t FIRQPR0;
  uint32_t FIRQPR1;
  uint32_t FIRQPR2;
  uint8_t res1[4];

  uint32_t INTREQ0;
  uint32_t INTREQ1;
  uint32_t INTREQ2;
  uint8_t res2[4];

  uint32_t REQMASKSET0;
  uint32_t REQMASKSET1;
  uint32_t REQMASKSET2;
  uint8_t res3[4];

  uint32_t REQMASKCLR0;
  uint32_t REQMASKCLR1;
  uint32_t REQMASKCLR2;
  uint8_t res4[4];

  uint32_t WAKEMASKSET0;
  uint32_t WAKEMASKSET1;
  uint32_t WAKEMASKSET2;
  uint8_t res5[4];

  uint32_t WAKEMASKCLR0;
  uint32_t WAKEMASKCLR1;
  uint32_t WAKEMASKCLR2;
  uint8_t res6[4];

  uint32_t IRQVECREG;
  uint32_t FIQVECREG;
  uint32_t CAPEVTSRC;
  uint8_t res7[4];

  uint32_t CHANCTRL0;
  uint32_t CHANCTRL1;
  uint32_t CHANCTRL2;
  uint32_t CHANCTRL3;
  uint32_t CHANCTRL4;
  uint32_t CHANCTRL5;
  uint32_t CHANCTRL6;
  uint32_t CHANCTRL7;
  uint32_t CHANCTRL8;
  uint32_t CHANCTRL9;
  uint32_t CHANCTRL10;
  uint32_t CHANCTRL11;
  uint32_t CHANCTRL12;
  uint32_t CHANCTRL13;
  uint32_t CHANCTRL14;
  uint32_t CHANCTRL15;
  uint32_t CHANCTRL16;
  uint32_t CHANCTRL17;
  uint32_t CHANCTRL18;
  uint32_t CHANCTRL19;
  uint32_t CHANCTRL20;
  uint32_t CHANCTRL21;
  uint32_t CHANCTRL22;
  uint32_t CHANCTRL23;
};

#define VIM (*(volatile struct VIM_tag *) 0xfffffe00)

struct VIMPAR_tag
{
  uint32_t PARFLG;
  uint32_t PARCTL;
  uint32_t ADDERR;
  uint32_t FBPARERR;
};

#define VIMPAR (*(volatile struct VIMPAR_tag *) 0xfffffdec)

struct POM_tag
{
  uint32_t GLBCTRL;
  uint32_t REV;
  uint32_t CLKCTRL;
  uint32_t FLG;
  uint8_t res0[496];

  uint32_t PROGSTART0;
  uint32_t OVLSTART0;
  uint32_t REGSIZE0;
  uint8_t res1[4];

  uint32_t PROGSTART1;
  uint32_t OVLSTART1;
  uint32_t REGSIZE1;
  uint8_t res2[4];

  uint32_t PROGSTART2;
  uint32_t OVLSTART2;
  uint32_t REGSIZE2;
  uint8_t res3[4];

  uint32_t PROGSTART3;
  uint32_t OVLSTART3;
  uint32_t REGSIZE3;
  uint8_t res4[4];

  uint32_t PROGSTART4;
  uint32_t OVLSTART4;
  uint32_t REGSIZE4;
  uint8_t res5[4];

  uint32_t PROGSTART5;
  uint32_t OVLSTART5;
  uint32_t REGSIZE5;
  uint8_t res6[4];

  uint32_t PROGSTART6;
  uint32_t OVLSTART6;
  uint32_t REGSIZE6;
  uint8_t res7[4];

  uint32_t PROGSTART7;
  uint32_t OVLSTART7;
  uint32_t REGSIZE7;
  uint8_t res8[4];

  uint32_t PROGSTART8;
  uint32_t OVLSTART8;
  uint32_t REGSIZE8;
  uint8_t res9[4];

