iSYSTEMLabs/winIDEAExampleWorkspaces/TI/RM48L950/targetInit/RM48L950_sfr.h
  uint32_t PROGSTART9;
  uint32_t OVLSTART9;
  uint32_t REGSIZE9;
  uint8_t res10[4];

  uint32_t PROGSTART10;
  uint32_t OVLSTART10;
  uint32_t REGSIZE10;
  uint8_t res11[4];

  uint32_t PROGSTART11;
  uint32_t OVLSTART11;
  uint32_t REGSIZE11;
  uint8_t res12[4];

  uint32_t PROGSTART12;
  uint32_t OVLSTART12;
  uint32_t REGSIZE12;
  uint8_t res13[4];

  uint32_t PROGSTART13;
  uint32_t OVLSTART13;
  uint32_t REGSIZE13;
  uint8_t res14[4];

  uint32_t PROGSTART14;
  uint32_t OVLSTART14;
  uint32_t REGSIZE14;
  uint8_t res15[4];

  uint32_t PROGSTART15;
  uint32_t OVLSTART15;
  uint32_t REGSIZE15;
  uint8_t res16[4];

  uint32_t PROGSTART16;
  uint32_t OVLSTART16;
  uint32_t REGSIZE16;
  uint8_t res17[4];

  uint32_t PROGSTART17;
  uint32_t OVLSTART17;
  uint32_t REGSIZE17;
  uint8_t res18[4];

  uint32_t PROGSTART18;
  uint32_t OVLSTART18;
  uint32_t REGSIZE18;
  uint8_t res19[4];

  uint32_t PROGSTART19;
  uint32_t OVLSTART19;
  uint32_t REGSIZE19;
  uint8_t res20[4];

  uint32_t PROGSTART20;
  uint32_t OVLSTART20;
  uint32_t REGSIZE20;
  uint8_t res21[4];

  uint32_t PROGSTART21;
  uint32_t OVLSTART21;
  uint32_t REGSIZE21;
  uint8_t res22[4];

  uint32_t PROGSTART22;
  uint32_t OVLSTART22;
  uint32_t REGSIZE22;
  uint8_t res23[4];

  uint32_t PROGSTART23;
  uint32_t OVLSTART23;
  uint32_t REGSIZE23;
  uint8_t res24[4];

  uint32_t PROGSTART24;
  uint32_t OVLSTART24;
  uint32_t REGSIZE24;
  uint8_t res25[4];

  uint32_t PROGSTART25;
  uint32_t OVLSTART25;
  uint32_t REGSIZE25;
  uint8_t res26[4];

  uint32_t PROGSTART26;
  uint32_t OVLSTART26;
  uint32_t REGSIZE26;
  uint8_t res27[4];

  uint32_t PROGSTART27;
  uint32_t OVLSTART27;
  uint32_t REGSIZE27;
  uint8_t res28[4];

  uint32_t PROGSTART28;
  uint32_t OVLSTART28;
  uint32_t REGSIZE28;
  uint8_t res29[4];

  uint32_t PROGSTART29;
  uint32_t OVLSTART29;
  uint32_t REGSIZE29;
  uint8_t res30[4];

  uint32_t PROGSTART30;
  uint32_t OVLSTART30;
  uint32_t REGSIZE30;
  uint8_t res31[4];

  uint32_t PROGSTART31;
  uint32_t OVLSTART31;
  uint32_t REGSIZE31;
  uint8_t res32[2820];

  uint32_t ITCTRL;
  uint8_t res33[156];

  uint32_t CLAIMSET;
  uint32_t CLAIMCLR;
  uint8_t res34[8];

  uint32_t LOCKACCESS;
  uint32_t LOCKSTATUS;
  uint32_t AUTHSTATUS;
  uint8_t res35[12];

  uint32_t DEVID;
  uint32_t DEVTYPE;
  uint32_t PERIPHERALID4;
  uint32_t PERIPHERALID5;
  uint32_t PERIPHERALID6;
  uint32_t PERIPHERALID7;
  uint32_t PERIPHERALID0;
  uint32_t PERIPHERALID1;
  uint32_t PERIPHERALID2;
  uint32_t PERIPHERALID3;
  uint32_t COMPONENTID0;
  uint32_t COMPONENTID1;
  uint32_t COMPONENTID2;
  uint32_t COMPONENTID3;
};

#define POM (*(volatile struct POM_tag *) 0xffa04000)

struct EMIF_tag
{
  uint32_t REVCDSTAT;
  uint8_t res0[12];

  uint32_t ASYNC1CFG;
  uint32_t ASYNC2CFG;
  uint32_t ASYNC3CFG;
  uint32_t ASYNC4CFG;
  uint32_t SDRAMTIMING;
  uint32_t SDRAMSTAT;
  uint32_t DDRPHYCTRL;
  uint32_t DDRPHYSTAT;
  uint32_t SDRAMACCESS;
  uint32_t SDRAMACTIVAT;
  uint32_t DDRPHYIDREV;
  uint32_t SDRAMSREXTIMING;
  uint32_t INTRAW;
  uint32_t INTMASK;
  uint32_t INTMASKSET;
  uint32_t INTMASKCLR;
  uint32_t IOCTRL;
  uint32_t IOSTAT;
  uint32_t SDRAMCONFIG2;
  uint32_t ONENANDFLASHCTRL;
  uint32_t NANDFLASHCTRL;
  uint32_t NANDFLASHSTAT;
  uint32_t PAGEMODCTRL;
  uint8_t res1[4];

  uint32_t NANDFLASHCS2ECC;
  uint32_t NANDFLASHCS3ECC;
  uint32_t NANDFLASHCS4ECC;
  uint32_t NANDFLASHCS5ECC;
  uint8_t res2[4];

  uint32_t IODFTEXECCOUNT;
  uint32_t IODFTGLOBCTRL;
  uint8_t res3[4];

  uint32_t IODFTADDRMISRRESULT;
  uint32_t IODFTDATAMISRRESULT;
  uint32_t IODFTCTRLRESULT;
  uint8_t res4[20];

  uint32_t MODULEREV;
  uint8_t res5[8];

  uint32_t NANDFLASHECCLOAD;
  uint32_t NANDFLASHECC1;
  uint32_t NANDFLASHECC2;
  uint32_t NANDFLASHECC3;
  uint32_t NANDFLASHECC4;
  uint32_t NANDFLASHERRADDR1;
  uint32_t NANDFLASHERRADDR2;
  uint32_t NANDFLASHERRADDR3;
  uint32_t NANDFLASHERRADDR4;
};

#define EMIF (*(volatile struct EMIF_tag *) 0xfcffe800)

struct PCR_tag
{
  uint32_t PMPROTSET0;
  uint32_t PMPROTSET1;
  uint8_t res0[8];

  uint32_t PMPROTCLR0;
  uint32_t PMPROTCLR1;
  uint8_t res1[8];

  uint32_t PPROTSET0;
  uint32_t PPROTSET1;
  uint32_t PPROTSET2;
  uint32_t PPROTSET3;
  uint8_t res2[16];

  uint32_t PPROTCLR0;
  uint32_t PPROTCLR1;
  uint32_t PPROTCLR2;
  uint32_t PPROTCLR3;
  uint8_t res3[16];

  uint32_t PCSPWRDWNSET0;
  uint32_t PCSPWRDWNSET1;
  uint8_t res4[8];

  uint32_t PCSPWRDWNCLR0;
  uint32_t PCSPWRDWNCLR1;
  uint8_t res5[8];

  uint32_t PSPWRDWNSET0;
  uint32_t PSPWRDWNSET1;
  uint32_t PSPWRDWNSET2;
  uint32_t PSPWRDWNSET3;
  uint8_t res6[16];

  uint32_t PSPWRDWNCLR0;
  uint32_t PSPWRDWNCLR1;
  uint32_t PSPWRDWNCLR2;
  uint32_t PSPWRDWNCLR3;
};

#define PCR (*(volatile struct PCR_tag *) 0xffffe000)

struct TCRAM_RAMWRAPPER_EVEN_tag
{
  uint32_t CTRL;
  uint32_t THRESHOLD;
  uint32_t OCCUR;
  uint32_t INTCTRL;
  uint32_t ERRSTATUS;
  uint32_t SERRADDR;
  uint8_t res0[4];

  uint32_t UERRADDR;
  uint8_t res1[16];

  uint32_t RAMTEST;
  uint8_t res2[4];

  uint32_t RAMADDRDEC;
  uint32_t RAMPERRADDR;
  uint32_t INITDOMAIN;
  uint32_t BANKDOMAINMAP0;
  uint32_t BANKDOMAINMAP1;
};

#define TCRAM_RAMWRAPPER_EVEN (*(volatile struct TCRAM_RAMWRAPPER_EVEN_tag *) 0xfffff800)

struct TCRAM_RAMWRAPPER_ODD_tag
{
  uint32_t CTRL;
  uint32_t THRESHOLD;
  uint32_t OCCUR;
  uint32_t INTCTRL;
  uint32_t ERRSTATUS;
  uint32_t SERRADDR;
  uint8_t res0[4];

  uint32_t UERRADDR;
  uint8_t res1[16];

  uint32_t RAMTEST;
  uint8_t res2[4];

  uint32_t RAMADDRDEC;
  uint32_t RAMPERRADDR;
  uint32_t INITDOMAIN;
  uint32_t BANKDOMAINMAP0;
  uint32_t BANKDOMAINMAP1;
};

#define TCRAM_RAMWRAPPER_ODD (*(volatile struct TCRAM_RAMWRAPPER_ODD_tag *) 0xfffff900)

